{"pages":[],"posts":[{"title":"2018年读书笔记","text":"一切能够形成判断是知识。知识的唯一形式即判断，唯有判断才是知识，知识由理性负责。见识是历史经验的记忆构成，见识中包含有各种杂多和叙事，由知性负责。对外界信息的最初的感知和收集是意识，由感性负责。 《纯粹理性批判演讲录》 【中】邓晓芒《思辨的张力——黑格尔辩证法新探》 【中】邓晓芒《逻辑哲学论》【奥地利】维特根斯坦《普通语言学教程》 【瑞士】 费尔迪南·德·索绪尔《货币金融学》 【美】FredericS．Mishkin《经济学原理》 【美】 N·格里高利·曼昆《就业、利息和货币通论》 【英】 约翰·梅纳德·凯恩斯《摄影构图学》 【美】本·克来门茨 / 大卫·罗森菲尔德《美国摄影用光教程》 【美】Fil Hunter / Steven Biver / Paul Fuqua《西方城市规划思想史纲》 【中】张京祥 技术类：《CLR via C#》 【美】Jeffrey Richter《Windows核心编程》 【美】Jeffrey Richter《TCP/IP网络编程》 【韩】尹圣雨《深入理解计算机操作系统》【美】Randal E.Bryant / David O’Hallaron","link":"/2019/01/02/2018年读书笔记/"},{"title":" 2015读书总结","text":"2015年读过的那些书 读几本书，培养一两个个新的兴趣爱好，交三两个朋友，随便来场旅行，哈哈哈，快慰平生啊。 又是一年快要过去了，真是时光如水啊！还记得去年写这篇文章的时候还是在南京，那是一次午夜加班回家后，突然就想整理一下这一年以来发生的事情，记事总要有条主线。 可能因为平时比较忙，没有时间一本一本的把笔记都记下来写在博客上。所以在这次整理的时候，我会尽量把一些心得写下来，但是很难写全。 今年的读书路线很有意思！按照我之前的规划是：艺术、文学、哲学、心理学、社会行为学、专业相关、一到两本的畅销书，加上回顾一下去年读的一些书。 因为我三月份到上海，之间找工作，找房子耽误了很多时间，所以上半年几乎是没怎么学习。等我一切安定下来以后，发生了一件让我震惊的事情，五六月份的股市飙升。虽然我不炒股，但是却莫名的害怕，可能从小就有居安思危的观念吧！这些表面上跟我们没直接关系的事情，却很可能是一种间接的资本掠夺。 于是我开始了解经济类的一些内容，然后又牵扯到国家博弈，地缘政治，于是我去读世界历史，看纪录片，了解经济学基本原理，读巴菲特，本杰明。后来有些感悟，又去读西方哲学史，从柏拉图到斯宾诺莎；中国哲学史，从诸子百家到程朱理学以及陆王心学。 总体来说，这一年读的书功利性比较强，非我所爱。可是也更深刻的理解了一些东西，看待问题的角度和视野也发生了一些变化。 明年的计划基本是，看康德和黑格尔，还有写几篇文章（《格局与视野》，《我非凡人，我本狂人》，《自私的境界》，《犬儒与个性》，《时代的烙印》、《读书与选书》暂时先定这几个），还有打算深入研究一下算法，计算机图形学的内容！ 先列书单：电子书会特别表明，其它都是正版纸质书籍（每次搬家的一大苦恼，所以先带到公司去，再带回去）。 哲史人文类 《全球通史》 （上下）美 L. S. 斯塔夫里阿诺斯 《中国哲学简史》 中国 冯友兰 《西方哲学史》（下）美 罗素 《人文经典导读》 中 李文堂（可读可不读） 《西游记》（电子版） 中 吴承恩（经典被网络和电视剧误解了太多） 《林微因传》 中 白落梅 《哲学的慰借》 英 阿兰德波顿 《极简欧洲史》 约翰－赫斯特 《生命不可承受之轻》 《中国史学入门》 创业理财 《Zero to One》 美 彼得·蒂尔 布莱克·马斯特斯 《人月神话》 美 弗雷德里克·布鲁克斯 《黑客与画家》 美 Paul Graham 《巴菲特给股东的信》美 巴菲特 《财富是理出来的》 中 计算机专业类 《ShaderLab编程》 中 《编译原理》（未完） 兴趣爱好类 《灵飞经》 《道德经》 唐 颜真卿 《柳公权楷书》 唐 柳公权 《颜真卿多宝塔碑》 唐 颜真卿 《伯里曼人体结构绘画教学》 美 伯里曼 下面是书籍内容的简单描述： 《全球通史》 全球通史，主要是欧洲历史和部分的亚非拉历史。尽管作者的观点一再中立，但是因为阿诺斯是美国人，还是会站在欧洲的角度去看世界。这本书从古希腊罗马时期一直写到二战过后的世界秩序建立。英国的君主立宪一直写到中国的社会主义建立，跨越了时间、空间、宗教、文化、经济、人文、地理。读完以后你会明白今日法国恐怖主义的根源，你会了解巴尔干半岛局势为何会这样，你会明白，当今世界真正的秩序是怎么样的。你会明白以后世界上只有两个国家，中国和美国。印度永远不会对中国地位造成威胁。人口红利消失的真正命题是什么。 点评： 当今世界局势依旧是一战的延续，变相的殖民主义。发达国家利用国际组织，对全球发动资本掠夺，地区代理国，为了大国利益，变相对周围国家殖民，上交利益到代理主国。 作者站在全人类的角度写了这本书，无论是探究历史，拓展视野，还是立足现在，布局未来都有很大帮助。 《中国哲学简史》 冯友兰老先生这个人怎么样不去探讨，但是他对中国哲学史研究有很大贡献。这本书从先秦百家哲学讲起，到秦用法家一统六国，汉朝重用儒家，汉在经学之外又诞生了纬学，西晋的风流之士，受佛教东入的刺激，民间建立起了道教，道生，僧肇将道家和儒家的学说吸收之后再揉合佛家的哲学，形成新的禅宗；再到周敦颐，二程分别创立心学理学，朱熹，王阳明将两种学说集大成，明清之后一直影响到现在。 全书阐述了各家之间的立场，地位，对统治阶级的影响，汉之后各家学说的兴衰，新的学说兴起，儒道佛三家统一，再到程朱理学，路王心学，一路下来可以看到中国封建社会，道德伦理的发展历程以及学术对于时代的再解释和再发展。 点评： 对哲学有兴趣的朋友可以好好看看，在其中我们可以看到我们对于中国哲学的很多误解！ 《西方哲学史》（下）美 罗素 罗素是大家，而且全书没看完，不便做整体点评。不过明显可以看出的是中文翻译上有很多问题，本来西方哲学的逻辑性就很强，译者翻译的有些过于直接，没有根据中文的语法作必要的整理。中文和英文最主要的区别就是语言逻辑上的区别。 哲学被罗素说是一个介于世俗和宗教之间的东西，很有趣的观点。西方哲学可以说是科学的科学。之所以这么说是因为西方哲学很多时候一直受到科学进步的影响，当然西方哲学也有很多形而上的老家伙，但是他们对于世界本源的追求和探讨常常是带我们走近一个奇妙的世界。 点评：看完再说，不过我之前看叔本华的时候，发现自己是一个积极的悲观主义者。周国平说他和尼采一样，已经脱离了悲观主义和乐观主义这样的狭隘的定义。 《人文经典导读》 可读可不读，书写的过于中国官方，观点没有任何新意，重要部分点到即止，不敢铺陈展开。没意思。 《西游记》 原著被电影和电视剧改编的已经不成样子了，最好还是可以回去读一读经典，里面会发现以前我们未曾注意的地方。 比如：猴子一共睡了几个妖精？佛祖比较忌惮的人有哪几个？二十八星宿有哪些家禽？猴子有几次是被吓尿的？哈哈哈哈，很有意思的！ 《林微因传》 你是爱，是暖，是希望，你是人间的四月天！ 林微因时典型的江南女子，大家闺秀的一生。多才多艺，才子佳人。徐志摩、梁思成、金岳霖，她这一生有这三个男子就够了。 一个桃花初开时爱恋。那时的林微因，二八年华，情窦初开，虽是才华初现，但是终是女子，封建社会时终是不宜抛头露面的。那时遇见了满腹才华，意气风发的徐志摩，从此情爱牵挂心头，冤孽伴随一生。 一个是相伴一生的爱人。他俩从小定亲，奈何世事动荡，相逢总比相离长。像林微因这样的女子经历过徐志摩哪激情澎湃的爱情之后，终归是要回归平淡的，所以梁思成成了她最终的归宿。 一个是与世长辞之后仍记心间的蓝颜知己。有一次，金岳霖把那批老朋友叫到一起聚会，开始之前他说：“今天是她的生日！”那时的她已因病离世近一年有余。 点评： 女孩子推荐读一遍，书里的文字柔美华丽，很适合当散文来读。 《哲学的慰借》 去年读过，今年又拿过来再翻一遍。现在看来，德波顿许多观点和总结都是错的，不过仍然不妨碍它作为一个哲学入门级读物。点评： 哲学入门读物，写了苏格拉底，柏拉图，蒙田，叔本华，尼采等几位哲学家的人生和哲学，入门推荐，观点有部分不够严谨。可读可不读。 《极简欧洲史》 主要是写欧洲兴衰和西方宗教发展，全书不长，生动有趣，可以在读全球通史之前读一下试试。 在欧洲历史的演进过程中，宗教对于帝国的影响，宗教的权利的兴起和衰落，世俗帝国和宗教之间的对抗，以及欧洲的帝国和东方的帝国的不同之处。 欧洲的皇帝和中国古代的皇帝有很多地方不同，中国的皇帝既有世俗的权利又拥有宗教意义上的权利，中国的皇帝大部分都把持着军队调用权利和地方的官员以及税收征收的权利。而欧洲的皇帝大部分时间只拥有世俗的权利，而且其本身的权利常常受到贵族和地方诸侯的限制，欧洲的皇帝长期都在和贵族争夺世俗的权利，和教皇争夺对人民通知的权利，他们相对更重视商业和中产阶级。 点评：作者对于历史的归纳总结的很好，几幅图几乎就把欧洲的历史简单的介绍一遍，深入浅出，值得一读。 《中国史学入门》 顾颉刚老师对中华文化的探究和理解，很多新颖的观点和我们教科书的内容完全不同。 书里的内容都是言简意赅，顾颉刚老师详细探究了中华文化的起源和流传，中华神话故事里人物的真实性，诸子百家的学说来源以及著作作者究竟是哪些人。 应该说这是一本严肃的史学入门材料，以当时的条件，顾颉刚老师详细的考究了中华文化和历史，尽管有些内容在今天看来不准确，但是大部分内容都还是具有很大的研究价值，对于我们正确的看待历史有很大的帮助。 创业理财类 《Zero to One》 美 彼得·蒂尔 布莱克·马斯特斯 这本书在今年上半年创投圈很火，背后的原因，一方面国家鼓励创业，政策引导，另一方面，移动互联网时代，创业的成本更低，相关媒体引导，最后就是出版商的舆论引导和轰炸。 作者作为明星创业者和美国硅谷创投圈的大佬，自然见解不凡。当时全书读完，只需要用两句话来概括： 从零到一：是一个创造的过程，是一个新颖的想法发生到产品完成的阶段，这是真正创造价值的阶段。从一到一百：是一个聚变的过程，在用户的拥护下，产品自由成长，最终爆发性的蔓延到全世界，这是价值得到真正体现的阶段。 而中国国内目前的大部分企业都还是从一到一百的过程，无论是阿里还是百度或是其它，都是拿国外的商业模式Copy到国内本土化，然后快速扎根，迅猛发展。腾讯算是国内唯一一个可以算上时从0.5到1的模式，然后利用本身社交优势，快速从一到一百。 点评：上面总结就是全书内容，爱读不读。 《人月神话》 美 弗雷德里克·布鲁克斯一个人一个月可以完成的工作量！这就是人月神话。全书主要讲的是计算机行业项目管理的内容，但是同样可以拓展到其他的行业里去。 有时候人多了并不一定可以缩短项目周期，技术类的工作有一个平衡的基数，人多了反而会增加沟通和协同的成本，反而会使项目开发周期增加。 点评：如果往产品经理方向有兴趣的童鞋可以一看。 《黑客与画家》 美 Paul Graham 作者小时候学过画画，然后又学习了计算机开发！全书更像是在推广一门编程语言Lisp，But作者有时候崩发出的小论点很有意思，跟中国式的思维方式很不一样。对于拓展自身的见解可能帮助更大一些，当然这本书也是主要写创业的。 点评：可看可不看。 《巴菲特给股东的信》美 巴菲特 《财富是理出来的》 中 介绍了目前市场上主流的理财方式和风险，对于普及理财知识很有意义。推荐看一下。 技术类的和个人兴趣类的就不写了暂时，以后有空补上。","link":"/2015/12/18/2015读书总结/"},{"title":"2016读书总结篇","text":"先献上前两年的书单地址： 《2015年读书总结》《2014年读书总结》 内容比较长，阅读的人可能不一定会看完，只是我自己每年做的一个记录而已。 这份书单已经写了两年了，加上这篇，这份博客已经写了三年了，特么的，我也不知道我是怎么想的，但是就是这么写下来了。每一年都会给自己安排新的读书计划，然后总结过去一年自己的完成度，林林总总，反反复复，就这么过来了，其实我想熬点鸡汤给人喝来着，可惜厨艺不佳，平时也只有自己失落难过的时候会自己熬点喝了，嗯！味道一般。 如果有人能够看到这些，觉得我还算不错，算是个有计划，有目标并且能够为之行动而且坚持的人，那么，请把你妹妹介绍给我。 我时常觉得时间过得真快，感觉写上一份读书总结的时候还是前几个月的事。 2016年算是一个沉淀，新的平台，新的机遇，新的认识以及迎接新的挑战。 这一年发生了很多的事情，游戏行业泡沫破裂，资本快速撤离，大批公司倒闭，一切如风卷残云一般吞噬着这个行业，能够留下的要么是自身实力过硬，要么是背景够深，再就是运气够好。 这一年的读书计划，有一些未完成的，也有一些超过当时预期的。总体来说，技术类的书籍算是未完成，人文历史艺术文学哲学经济类的书籍算是超预期完成。 技术类的没有完成肯能一方面由于我平时的知识积累和计划要学的知识重复了，另外一方面可能由于我所选的书籍比较难，难啃，所需要的基础知识和理工科知识比较多和杂，所以在啃的时候总是会遇到难点，不由自主的就会停下来。 至于其他类的读的多，一是因为住的地方离公司比较远，所以在地铁上的整片嘈杂时间比较多，二是因为兴趣和理解越来越深，就越加感觉自身知识体系内很多方面的匮乏，所以努力想去补足一些。 明年的计划大概是先扑在专业领域，虽然平时会跟进一些新技术，但是在系统性知识结构这块该拿起来补补了，主要是太久没啃硬骨头了。其次大概还是会在哲学、历史、地理、艺术类的书籍上加深造诣，着重在哲学领域，目前手里已经有了几本书在读了，其实我一直有在写一些东西，但是从来没给别人看过，所以暂时也不会发出来。 非技术类： 《中国哲学史大纲》 胡适《心与禅》 胡适《大棋局：美国的首要地位及其地缘战略》 【美】兹比格纽·布热津斯基《历史的地理枢纽》 【英】哈尔福德麦金德《大博弈》【美】兹比格纽·布热津斯基《狂人日记》 鲁迅《穷理查智慧书》 【美】富兰克林《纯粹理性批判》讲演录 邓晓芒《经济学原理》 【美】曼昆《反脆弱》 纳西姆·尼古拉斯·塔勒布《人生定位》《毛泽东点评历史》 欧薇薇，盛仰红，和盛巽昌《黄金时代》 王小波《知行合一王阳明》 度阴山《萧十一郎》 古龙《倚天屠龙记》 金庸《名人传记——李白》 皮波人物国际名人研究中心《庄子白话全释》 文史哲《七堂极简物理课》 卡洛·罗韦利《白鹿原》 陈忠实《钓愚-操纵与欺骗的经济学》 乔治·阿克洛夫 罗伯特·席勒《人类简史-从动物到上帝》 尤瓦尔·赫拉利《庄子》 庄子《苏轼集》 苏轼《哲学家们都干了什么》 林新皓《斯坦福极简经济学》 【美】蒂莫西·泰勒 翻译：林隆全《少年维特的烦恼》 【德】歌德《极简欧洲史》 约翰·赫斯特 翻译：席玉萍《论十大关系》 毛泽东《星星之火可以燎原》 毛泽东《关于正确处理人民内部矛盾》 毛泽东《矛盾论》 毛泽东《论持久战》 毛泽东《毛泽东诗集》 毛泽东《月亮和六便士》 【英】威廉·萨摩赛特·毛姆 翻译：李继红《基督山伯爵》 【法】大仲马《人间词话》 王国维《道德经》 老子 技术类《计算机操作系统》《图解TCP/IP》《UnityShader入门精要》《计算机图形学》《深入理解计算机系统》 今年的书读的比较多，也比较杂。我简要分为哲学历史类、地缘政治类、诗歌散文类、经济社会类以及其他类来一起简单的说说。 哲学历史《中国哲学史大纲》胡适这本书是中国人用现代学术方法系统性研究总结哲学史的第一部著作，可惜胡适先生只完成了上部，下部并未写完。大概得益于胡适先生早年在西方的留学经历，在对中国两千多年的哲学史进行研究和整理的时候，胡适先生大胆的砍去了上古的一些神话传说和一些当时未被考据的历史，直接从春秋时期的老子、孔子讲起，这是需要很大的魄力的。即便现代的西方哲学史也是从最早的神话时期讲起，几乎没人敢上来直接说苏格拉底和亚里士多德，可见胡适先生是何等的大气魄。 林语堂先生说胡适：”明明什么都没完成，但却开创了一切。“推荐阅读全书，可以配合冯友兰老先生的《中国哲学史》一起读。 《心与禅》胡适这本书主要是讲的是禅宗在中土的起源发展以及传播。佛教早在东汉时期就已经和贸易一起传入中土，梁武帝时期，达摩来到中土，将佛教发扬光大。早在达摩之前，中国本土出了两位惊才绝艳的佛家弟子，道生和僧肇，这两位佛家弟子凭借他们的聪明才智、不懈努力，将印度佛教改造成了中国佛教。佛教在传入中国之前，在印度就分为很多流派，修行方法也各有不同，达摩属于苦行一派，之后一直到五祖弘忍。弘忍之后衣钵传于慧能，而弘忍的大弟子神秀继承了弘忍的地位继续传播佛法，慧能回到南方传播佛法，慧能去世以后，慧能的弟子神会向北方的神秀一派宣战，并质疑神会的衣钵，后经多年坎坷，南方的神秀一派大获全胜，取代了当时如日中天的北方苦修一派。慧能一派在南方几乎掀起了一场中土佛教的革命，他讲究心得顿悟，反对坐枯禅，苦行修的方法，后来神会凭借一己之力北伐成功，南方一派的思想开始在整个中原大地上传播。后来禅宗一直推崇心得修行和去除一些早期印度佛教的繁文缛节，后来玄奘西行回来后有重新把印度佛教复杂的制度和教义带回，但终究在历史的发展中被抛弃。 前半部读起来比较有意思，后半部就有点流水账和翻译文集的意思了，大概由于禅宗一派不著文字，以致胡适先生难以找到具体的资料可供研究。 《毛泽东点评历史》 这本书不是毛主席自己写的书或者文字，而是根据毛当年身边的人和一些接见的人的笔记和记录中根据时间的顺序摘抄整理出来的一本书。 虽然不是毛亲自写的书，但是都是毛亲口说出来，身边人记录下来的，有这些记录中可以看到一位战略家，诗人，政治家是如何解读历史的。 毛对于历史的掌握确实到了一个让人叹为观止的境界，每到一地都喜欢阅读当地的县志，了解当前的历史风俗文化，他也推荐一些地方官多了解一些地方上的历史，从古人的事迹中寻求智慧和教训。 毛在解放全中国后，进京之前一直惴惴不安，反复跟身边的人说”我们不要做闯王。“。 毛是比较推崇秦始皇的，秦始皇一统六国，结束了这片大地上多年的战乱，当时的情况和建国初期何其相似啊。后来有些文章说毛想做秦始皇，我看怕是不准确，毛的气魄和格局比秦始皇还要打得多啊。从他的诗一看便知： 惜秦皇汉武，略输文采，唐宗宋祖，稍逊风骚，一代天骄成吉思汗，只识弯弓射大雕。 大格局、大视野、大胸怀。 《人类简史-从动物到上帝》这本书早期在微博上被很多创业圈和互联网圈的名人推荐，甚至后来被一些人推荐位制作人和产品经理必读书籍，当时我并未看，因为我知道只要是畅销书，不论西方还是国内的，都是废话连篇，些微看点。 但是后来读这本书以后，我才发现我错怪了它，而且我错的还比较离谱。 这本书尝试从生物学和演化论的角度去解读人类的历史，以及整个历史发展中的经济文化发展。这本书的最大优点就是视角新颖，观点独特，这确实是一个很特殊也很有意思的视角，可以给我们提供看待问题的新的思路和解读。 但是这本书最大问题也是视角和观点，作者由于从这个独特的视角出发得到很多不一样但是却貌似合乎情理的结论，便开始进入了一个顽固偏执的心态中。很多现象和内容的解读并不适合或者根本不是生物学和演化论的内容，作者都会强行带进去进行解读，然后会得出一个似乎合乎大部分人生活常情的结论。然而这些结论其实是错误的，或者在历史发展中的很多阶段都是错误的。对，这本书里作者的结论和观点很多都是错误的，尤其是从专业的角度去看，更是错的很离谱。 举个最简单的例子：书中关于平等和货币的概念的描述，几乎就是偷换概念和强词夺理。一个社会学的名词和一个经济学的名词，被作者拿去用演化论解释出不一样的定义和结论。 最后，这本书还是要推荐读一读的，学习作者看待事情和历史的角度，但是要批判的接受一些内容。据说后面写的不太好，我没读到后面，我只读了前半部多一点，看到错误太多就读不下去了。 《极简欧洲史》 欧洲文明起源于希腊，传播到罗马，后来罗马的文明发展一度比肩和超越希腊。随着罗马帝国的扩张，希腊文明随之传播到了整个欧洲，甚至传播到亚非的一些地方。 说道欧洲史就不能避开宗教史，基督教是大部分欧洲人信仰的宗教。基督教早期起源于犹太教，犹太教本来是犹太人自己信仰的宗教，知道耶稣的出现，才开始把教义逐渐向外人开放。 由于基督教只信仰一个神，那就是上帝，犹太人自称上帝的选民。而当时如日中天的罗马人和希腊人都是信仰多神的，所以基督教在耶稣时期的传播很坎坷，耶稣甚至多次被迫害。耶稣死后，它的信徒保罗将教义重新解释，上帝关于爱的教诲适用于所有人，与此同时，基督教的教义也大于一切。 此时的基督教开始广为传播，同时也为日后教会统治欧洲奠定了伏笔。君士坦丁大帝将基督教尊为罗马帝国的国教以后，基督教正式登上了统治欧洲的舞台。一直到公元1400年左右，文艺复兴的开始，对基督教造成第一次冲击，随后不久16世纪的宗教改革，直接冲击了基督教教会的根本，信仰和权力。 而真正让基督教轰然崩塌的人物却是牛顿，这个天才人物的三大定律一出手，几乎将基督教千年来建立的制度和信仰掀了个底朝天。 三大定律首先证明了地球不是宇宙的中心，这个其实还好，起码吹吹牛还能圆回来，实在不行承认了也可以啊。但是紧接着牛逼顿就告诉所有人，上帝特么的也是不存在的，生活中的一切我们都是自己控制和解释的。教会一看，这特么的还怎么玩。 随后便是民主意识的重新觉醒，法国的大革命，随后英国的议会制，在随后便是日不落帝国的全球扩张。 整体来说，欧洲一直在分裂，一直在冲突，而伴随这些冲突和战争的确实文明的传播和发展。 这本书推荐一读。 地缘政治《历史的地理枢纽》 哈尔福德麦金德，一个懂历史的英国地理学家，地缘政治学的创始人。1904年，他发表了这篇论文，代表了地缘政治学的正式创立，然而他的观点在当时的英国并不受欢迎。但是他的观点却的到了当时德国纳粹的地理学家的赞赏，后来甚至传入纳粹军中高层。 麦金德用三句话归纳他的思想：“谁统治了东欧，谁就统治了大陆腹地；谁统治了大陆腹地，谁就统治了世界岛；谁统治了世界岛，谁就统治了世界。” 理解了麦金德的理论思想，就能理解今天伊朗地区为何一直战争不停，因为那里是世界岛，也是亚欧非的中心地带。也就能理解这届政府提出的“一带一路”战略的高明之处了。 这本书推荐看一看，对于提高人视野以及思考问题的格局很有帮助。 《大棋局：美国的首要地位及其地缘战略》 布热津斯基，美国当代著名的战略理论家，也是美国前国家安全事务助理。 苏联解体以后，美国成为全球唯一的超级大国。作者以此角度分析了全球的地缘政治格局、如何继续维持美国的霸权、如何面对中国的崛起、如何继续制衡欧洲、如何面对苏联解体后的最大遗产俄罗斯以及权力的真空、如何处理巴尔干地区。 尽管这本书是写于1997年，但是书中的种种预测几乎一一应验，比如：他预测中国的经济实力将会超越日本，到2020年左右将会和美国以及欧洲持平。书中对于中国的文化、历史、崛起中遇到的国内外各种矛盾的预测无不精准。至于作者对于日本、俄罗斯、欧洲的研究可能更为深入。 这本书非常值得一看，虽然作者是站在美国利益的视角去分析，但是其中值得我们学习和借鉴的地方非常多。 《大博弈》 诗歌散文类《庄子白话全释》《庄子》 我们现在流传比较多的版本多事西晋郭象所注，因其所收集的版本内容较全，编排次序合理。早在高中课本上学过一篇逍遥游，这篇文章天马行空的想象力和表达的哲理妙言令人印象深刻。 《庄子》这本书前半部简直就是奇书，其中思想壮阔深邃、却又让人读来平静淡然。庄子对于人生、命运、人伦、道德、人性的解读让人耳目一新、震耳发聩。读完你会明白道家的无为不是没有所作为，而是始终用一种超然洒脱的态度和行为来看待这世间的一切，无为而无所不为，是做到真正的至人无己，圣人无功，神人无名。 后面有部分显然不是庄子或者不是先秦之人所著，思想境界上差异颇大，至于杂篇里大部分是在重新论述之前的观点以及一些后人的伪作，第一遍看的时候可以简要过一遍，除非专门研究，不然下次就不必再看了。 从另一个角度看庄子这本书，《庄子》是中国最早的散文和寓言两种文学体裁，文笔流畅、意境高远。真是堪称大散文、大境界、大思想、大格局、大智慧啊。 《苏轼集》 这本书是我在kindle下看的，前年看林语堂先生的《苏东坡传》的时候就有想法把苏轼的诗集读一遍。后来因为繁琐之事太多被耽搁了，再到后面就忘记了，今年有空，把自己喜欢的一些诗词歌赋都翻出来读了个痛快。 诗歌经历了盛唐之后，就开始越来越走下坡路了，后人无论怎么写也超越不了盛唐的境界。到了宋朝以后，能写出好诗的也只有寥寥几人。后人在经历诗歌上无法突破的困境之后，反而在写词上有了更多的发展，可是那时的词大多软绵无力，或是咏物伤怀，或是花间旧事。 南唐灭亡之后，李后主从中思悟，总算是把词推上一个更高的境界。宋朝开国之后，重文轻武，词的意境得以更加发展，可是还是脱不了前人的桎梏。 直到苏东坡，这个一生坎坷却又乐观坚韧的人，一举开创了了词的豪放派风格，不仅如此，他也同时把这种风格推向一个后人难以企及的高度，古今仅此一人而已。 读苏轼的诗最好能先读它的生平，了解他的身处何种客观环境中写下这些诗篇，这样对于诗和人的理解都会更加透彻。 《毛泽东诗集》 毛主席也是偏爱豪放派诗词的人，他一生写过的诗篇，大都有种豪气云天、气吞山河的气势，其它风格的诗词也不过一手之数。 读毛的诗没什么可以评价的，就两个字“痛快”，每读完一篇都忍不住大呼“大丈夫当如此”。 比如这句开头：“横空出世莽昆仑，卷起玉龙三百万，搅得周天彻寒。”简直是豪气凌云，睥睨世间啊。 当然，毛的诗也可以当成史料来看，从他不同时期的诗，可以了解到他当时面对不同问题时的心境，我就不分析了。 很值得一看。 《人间词话》 王国维诗歌大器晚成的大师，当时投了未名湖之后，世人无不惋惜。奈何满腔才华却不着笔墨，留下的也唯有这篇《人间词话》的经典。 人间词话是王国维从意境上，根据自己深厚的国学功底和对诗词的研究，对古今的诗词进行梳理和评价，这本书越早读越好，对于我们理解其他的诗词会有很大帮助。 “词以境界为最上。有境界则自成高格，自有名句。”这本书开篇即定下了全书的基调，全书的也几乎全是围绕着词的境界来划分描述的。 作文艺批评，一在能体会，二在能超脱。必须身居局中，局中人知甘苦；又须身处局外，局外人有公论。此书论诗人之素养，以为“入乎其内，故能写之；出乎其外，故能观之。”吾于论文艺批评亦云然。 自来诗话虽多，能兼此二妙者寥寥；此《人间词话》之真价也。虽只薄薄的三十页，而此中所蓄几全是深辨甘苦惬心贵当之言，固非胸罗万卷者不能道。读者宜深加玩味，不以少而忽之。 其实书中所暗示的端绪，如引而申之，正可成一庞然巨帙，特其耐人寻味之力或顿减耳。明珠翠羽，俯拾即是，莫非瑰宝；装成七宝楼台，反添蛇足矣。此日记短札各体之所以为人爱重，不因世间曾有master pieces，而遂销声匿迹也。作者论词标举“境界”，更辨词境有隔不隔之别；而谓南宋逊于北未，可与颉颃者惟辛幼安一人耳，……凡此等评衡论断之处，俱持平入妙，铢两悉称，良无闲然。颇思得暇引申其义，却恐“佛头著粪”，遂终于不为；今朴社同人重印此书，遂缀此短序以介绍于读者。 一九二六年二月四日。 上面是俞伯平为人间词话写的序，再适合不过了。 经济社会类《经济学原理》 曼昆的经济学原理是经济学类学科入门书籍。书有上下两本，分别是微观经济学和宏观经济学。 这两本书写的深入浅出，本是专业类书籍，但是非专业人士也可以一读，书的内容我不好评价，但是对于一般的门外汉应该是很有帮助的，至于专业人员可能要根据具体的需要进行更深层次的研究。 《钓愚-操纵与欺骗的经济学》 书的作者是据说得过诺贝尔经济学奖得主，书的内容说实话没能给我太多惊喜。 书中的主要观点就是，欺骗，主要是利用了人的心理弱点和信息不对称。 然后两位诺贝尔经济学奖得主通过大量的数据和案例得出很多有意思的规律和总结，本质上都是由于上面两点。只不过作者用了一些经济学的和心理学的一些专业词汇进行了文辞上的包装，再加上一些啰嗦的案例，最后凑成了这本书。 可读可不读，西方畅销书一贯的尿性都有，惊喜却几乎没有。 《斯坦福极简经济学》 这本书和在看极简欧洲史的时候，看到评论里推荐的。这本书比起曼昆的经济学原理更加口语化，而且加了很多真实的案例分析，让人读起来不会那么枯燥。 书的前面说的都是微观经济学的内容，后面说的是宏观经济学，其中还会有许多政府会经常使用的政策进行分析和说明，其中也会对一些经济学知识的历史进行讲解，对于一般人入门和普及经济学的概念很好的读物。 小说类《狂人日记》多少年过去了，鲁迅的文字依然深刻的映射着这个社会，可是我们依然我行我素不知悔改。狂人日记：自己想吃人，又怕被别人吃了，都用着疑心极深的眼光，面面相觑。我翻开历史一查，这历史没有年代，歪歪斜斜的每页上都写着“仁义道德”几个字。我横竖睡不着，仔细看了半夜，才从字缝里看出字来，满本都写着两个字是“吃人”！ 《白鹿原》堪称中国近代一部史诗级的小说，写了从清末到建国初，白家和鹿家三代人的恩恩怨怨。描述了在历史的变迁中，人性的散失和道德的坚守，对於爱情的追求和生存的渴望。 白鹿原经历了太多，土匪，干旱，民国内战，国共斗争，日军侵华。家仇国恨，白鹿原在白鹿两家之间反复斗争着。 书中很多底层人民生活的真实细节和对于人物的刻画，让你感觉这就是作者自己经历过一样，一切历历在目。这本书属于必读。 《萧十一郎》《倚天屠龙记》少年时代最喜欢的两部武侠剧，吴奇隆的萧十一郎和苏有朋的倚天屠龙记。一部古龙，一部金庸。古龙的文字像是写意画，大笔一挥，一蹴而就，点到即止，处处留白。金庸的文字像是工笔画，处处行笔，缓缓推进，细细雕琢，浑然天成。古龙的文字像是小李飞刀，来无影去无踪，但是每一刀都会出现在该出现的地方。金庸的文字像是太极拳，虽是独创，却颇有来源，招式似缓实快，似无实有，时间越长后劲越加绵延无绝。 《黄金时代》王二的黄金时代就是在下乡时期和陈清扬进行了一场伟大的友谊，为了这伟大的友谊，两人干了不少在当时人开来的荒唐事，王二确实是个正直的混蛋，也只有这样的混蛋才能在那个时代能够突破一切束缚，只为了心目中那伟大的友谊。 黄金时代确实不错，值得一看，但是后面其它的几部相对就差了许多。 《月亮和六便士》这本书早有耳闻，但是真正让我想去翻出来读一读却是因为一位前同事的推荐。西方文学史我了解的不多，毛姆另一部比较有名的作品是《刀锋》，不过我没看过，西方文学作品除了一些校园时期读过的，其它的我是很少读，希望来年可以整理一下西方文学史，然后从中选读一些优秀的作品。 这本书表面是写一个离经叛道的投行工作人员查尔斯·斯特里克兰，有一天他突然抛弃自己的家庭，去追求自己的理想，想成为一个画家。这个时候的他已经人至中年，家庭美满，所有人都不理解他为什么要这么做。小说就此展开，作者使用第一人称的视角对斯特里克兰的故事展开叙述。斯特里克兰离开以后来到巴黎，过着穷困潦倒的生活，然而他对此毫不在意，或者说他已经没有一点物质上的追求了，甚至有点鄙夷这种世俗的行为，他只需要有东西吃和有地方住下就可以了。不但如此，他对于身边的人和一切困难都是鄙视的，大概他的心里只有理想，只有他对于美和艺术的追求。这一切形成了他独特的人格魅力。 斯特里克兰的人物原型是著名的画家保罗高更，都是生前落魄却对艺术狂热追求，死后成名的人物。 读完这本书后我们不禁会反思，人生的意义到底是什么，我们该为了自己的理想而狂热，不惜放弃一切，还是和普通人一样，在这世间平庸的生活，结婚生子，然后自然轮回？ 不知道，只有自己去寻找答案。 《基督山伯爵》 大概小学的时候看过这本书，那时候是我从学校的图书馆借来的书，很旧也很破。那个时候周末或是暑假，母亲不许出去乱跑，在家最大的乐趣就是看书了，因为母亲是教师，所以家里到处都是书籍。这类侠骨柔情，英雄复仇的小说最爱看了。 后来上了初中高中也会偶尔看看，但是现在想想已经很多年没有看了，其中很多情节都已经记不清了，所以就又拿出来翻一遍。 《少年维特之烦恼》 唉！别说少年了，即便是今天已是青年的我，依然有此烦恼。 大学时期朦朦胧胧的恋爱，像极了维特的情感，那时什么都不懂，甚至连第一次接吻都不会。而如今一切都成往事，维特却选择了一个悲伤的结局。其实陷入爱情中的人们那，谁又不想像维特那样为了自己的爱人去死呢。越是得不到，越是悲伤；越是悲伤，越是想吸引对方的注意，然而最悲伤的就是一场美丽的死去，那时候总以为这样她就会明白我的爱有多么深刻，我的离开有多么的悲壮。总以为自己的离开会让她幡然醒悟，可是却从未想过她背负了多少。 年少的爱情总是朦胧而又如此悲伤。 其它类《穷理查智慧书》富兰克林的名言警句，中英文对照版，书中并没有什么人生感悟或是高深理论，都是一句句短小的格言。更像是心灵鸡汤，比起中国古代的一些类似书籍如《菜根谭》、《道德经》差多了。 《大先生》民国时期的一些大家的吊文或者评说杂文，有心人收集起来编纂而来，可以无聊时读一读，了解一些人物趣事和大家之间的彼此评价。 《菊与刀》一个美国人写的关于日本社会文化书籍，没去过日本，也没有深入研究过日本的文化，对于真实的日本风俗文化了解的并不多，今年开始了解日本也是因为去年的股市大起大落和房地产市场的疯狂，开始了解经济相关知识和参考日本失去的十年。 这本书写的还是挺好的，深入浅出，有许多真实的调查数据可以参考，可以作为一本了解日本文化的入门性书籍。 《知行合一王阳明》心学自周敦颐开始，后来继承和发展的分别是程朱理学和陆王心学。用如今西方的哲学术语来说，程朱理学有点像客观唯心主义，而陆王心学更像是主观唯心主义。 这本书是一本人物传记，其中捎带说了一些王阳明的心学。王阳明被称为儒家最高境界“外王内圣”第一人，实际上他在世的时候并没有如此殊荣，封为侯爵也是在他去世以后的事，这应该是他后世的弟子为了宣传心学而打出的口号。 王阳明自有顽劣，但是他有一个很厉害的地方就是专注，喜欢什么就回去研究什么，并且非常专注，所以他能够集佛儒道三家大成于一身，最后从中发展出自己的心学。 王阳明似乎从龙场悟道以后，身上就有了一种独特的气质，一种让人信服和敬仰的气质，这大概就是一个人的势。一个人一旦看破了世间的狗苟蝇营，红尘俗世，以一种超然的态度来面对眼前的一切的时候，他就有了这种势。用西方的哲学术语来说，就是一个人有了自己的面对一切世界观和看待世界方法论，这个世界观就是良知，方法论就是致良知。我的一切所作所为都以自己心中的良知为标准。 历史似乎是故意让朱宸濠来成就王阳明的，从这个人的性格来看他实在不是一个合格的政治家，也不是一个像样的军事家，甚至连一个好的领导都不像，不知道他哪里来的自信来造反。不过再看看当时明朝的朝野状态似乎这件事也就不奇怪了。 这本书闲暇之余值得一读。 《名人传记——李白》李白出生在西域，自小在马背上长大，而李家作为当地的富家，加上大唐王朝的多年发展，对于中原文化的向往和落叶归根的情节，李白的父亲自小就请当地有名的先生教李白读书写字。 所谓十五观奇书，作赋凌相如。 后来李家迁入成都以后，李白当时的诗已经写得不错了，成年后李白开始寻仙问道，并拜师学艺。三年之后归来开始入中原游历，当时的李家生意遍布天下，加上李白生性豁达，英俊潇洒，文采斐然，爱结交朋友，很快就名满天下。 当时贺知章呼李白为谪仙人，并推荐给当时的皇帝唐玄宗，所以有了后面的力士脱靴和贵妃磨砚，在高力士和杨贵妃的谗言下，李白在长安只待了两年就离开了。不过他却做了一件改变唐朝国运的事情，救了著名的名将郭子仪。 这本书写的比较简略，很多内容点到即止，我也不做更多展开，建议一读。","link":"/2016/12/12/2016读书总结/"},{"title":"2017年读书笔记","text":"2016年读书笔记 2015年读书笔记 2014年读书笔记 年与时驰，意不能与日去。2017年就这么过去了，这一年里对于我而言没什么值得特别铭记的大事，一切都按部就班，一切都平静如水，只是在部分规划上落下了一些，不便详谈。今年的\b看的书要比去年少很多，主要原因是多了一些思考。我翻了一下去年的书单，竟然多达四十三本，当然其中有几本并没有读完。当我仔细翻看我的去年的书单的时候，发现很多书籍给我带来的不是真正的知识，而只是见识。 下面我从主客体角度讨论一下知识与见识，以及今年的部分思考，当然，没有任何行业相关内容。 在互联网信息化的今天，我们突然有了更多选择和接触信息的机会。而大部分人一旦突然拥有了选择的权力\b往往会不知所措，回过神来以后就会把权力在被动选择中\b放任到底。选择最大的偏见就是去选择我们喜欢的和我们感兴趣的事物，而那些不喜欢的\b、不感兴趣的或者不一样的事物就会被有意的或者无意的渐渐的消失在我们的时间线上。慢慢的我们的时间里会充斥着大量看似相似的内容，我们会慢慢的蜷缩在那个舒适的看见里，我们会慢慢的对\b外界其它从无所谓、无感到无知。 如果我们把信息的来源本身定义为元信息，那么我们直接从元信息里获得的资料集合\b定义为\b第一手信息。然而由于个体认知差异，每个个体\b获得的信息必然是不一样的，于是有了\b传播的需要。而由于\b人的惰性，大部分人往往不会对元信息信息进行深层构建和集合，直到逐渐失去了这个能力。那么在大部分人选择的时间线上的信息资料里，就会充斥着其他人构建后的资料和集合，这个时候\b我们大部分人接受到的就是多手信息。多手信息即元信息被个体初次构建集合后经其他个体多次删除、修改、再构建后传播的信息，传播的次数越多，信息中含有元信息的资料会越少，冗余和\b不准确\b的\b资料就会越多，即\b私货和偏见就越多。\b 反应到大部分个体就是对不被选择的信息我们逐渐无知，对于选择的信息我们进入了更深的偏见。当然，无知和偏见这部分属于见识了。 信息之上是见识，见识往往是大部分人一辈子的\b牢笼，因为见识\b里大部分都是别人思想的垃圾和\b意识形态的陷阱，这里就包括所谓的能力和常识，出了这个牢笼就是真正的知识。 知识与见识，虽然只有一字之差，所指的含义确是谬以千里。见识，指的是对所看见的事物加以认识之后的思维暂留。见识是对有差别的选择之后的无差别看见，更多的是在对现象世界的\b了解和知道，见识只能部分看见，无法整体看见。知识，是对认识的事物的认知存在。知识是在见识表面之后的存在，见识中\b会隐含着知识，但不是真正的知识，真正的知识必须通过意识的判断和思维之后在观念中形成思维存在。见识在于信息的收集和视野的拓展，而知识在于思维生成和理性逻辑。一切能够形成判断的是知识，一切能够形成看见的是见识。 见识多了，如果无法在更高的思维中进行知识的统觉综合\b往往会形成一种认识的瓶颈，即一种感觉明明自己知道的很多，却无法意识中更进一步的困境。此时个体会始终找不到突破口，\b再加上\b这一路上总是缺乏名师指路，\b往往在极度的痛苦中寻找出路，意识会在极度的自负和自卑中来回转换多次。大多数的时候甚至会剑走偏锋，妄图用一种短快奇的方式来给自己进行思维突破，有时候的确会有一些\b效果，甚至会产生一种特异的时空共鸣，思想在这里经奇点灵感的发散能够抽象和认识出很多以前自己难以理解和从未思考过得内容，会\b发现和形成一套自己的见识理论。但是这些理论和理解大多数的时候都是片面的，甚至是错误的。原因就在于\b短快奇只以一种刺入的方式进入知识的统觉中，认识\b到的往往只是知识的一个环节上的元素，或者逻辑上的一个步骤中的一个边角，这点东西大部分时候足以让人惊奇了。如果这个部分用的\b好了可以作为寻找真正知识的一个方向和突破口，但是大部分人都在沾沾自喜中逐渐被\b见识习惯所规范和遗忘掉了。见识大都停留在记忆里。 知识一种意识判断后的思维存在，拥有信息资料构建和审核的能力\b\b，\b以及对见识进行判断和抽象能力。任何个体都拥有知识，但是\b大部分个体缺乏深层次的纯粹的知识。深层次的知识会远离见识，但是对\b一切见识拥有基本分别的能力。浅层次的知识\b是一种初始的知识状态，大多数隐藏在见识中，少部分成为知识后却被见识反复纠缠，浅层次的知识只能对\b部分或对应的见识拥有判断的能力。\b当浅层次的知识摆脱\b见识的约束之后就称为真正的知识存在，\b知识\b存在不仅会对见识进行判断和逻辑，也会对已存在的知识\b存在进行判断和逻辑，然后知识存在会在知识存在中不断的彼此赋予和构建自身，赋予和构建的过程就是知识存在不断地向深层延展和\b抽象的过程。\b 深层抽象随后进入意识里构成认知，认知由纯粹的逻辑\b和抽象构成，认知会对知识进行审核和抽象，经由理性剔除一切存在相关，只留下逻辑和抽象。认知拥有观念现象根本的能力，拥有判断知识的能力，拥有选择见识的能力。意志通过认知将知识和见识应用现象世界。 自然语言在进入认知时已经显得苍白无力捉襟见肘了\b。认知之上是文字和语言也难以进入的领域，是一种纯粹的思维视觉和意识感知，它和现象世界\b唯一联系是逻辑，即通过认知来联系\b现象世界进行行为。 人类的思维习惯是线性的，非线性的\b规律往往会被大多数人潜意识刻意忽略或者否定掉。这就包括时间。 时间本来就是一个人为\b定义的度量词，各个文明和各个时期的记录和表述方式都不一样，但是基本上都是线性的表示，因为\b时间给我们的感觉是流逝的，\b一直向前走的，一步步推着我们走向终点。然而时间\b真的是线性的吗？时间的本质究竟是什么？时间是如何存在的？ 时间不过是人为便于思考现象世界，而对物质的运动划分，是一种人定规则。时间的本质是\b行为序列，时间的存在必然是伴随着\b空间的。时间实际上并不存在，时间是一种心智概念，通过在空间和数让人能够对行为先后排序进行\b看见。\b时间的存在必然伴随着空间和看见，没有空间\b则行为无法存在，没有看见则行为无法描述，即存在没有意义。当时间表现在\b\b现象世界里时被人为定义的标准所度量，\b为了方便被描述统一的行为序列，这就是我们正常在现象世界中使用的钟表刻度和北京时间的表示。而时间在深层意识里的时候，那么就会变成非线性\b行为。我们有时在深入的思考时候（或极为专注时）\b，会忘记了外在世界的时间存在，\b但我们思考完，\b注意力从深层次的意识\b中抽出来的时候，\b有时候明明感觉只有几分钟的思考，在现象世界的线性标准中却过去了半个小时之久，有的时候在意识中明明感觉过去了很长时间，而现象世界的线性标准中只过去了几分钟。\b西方的学者\b有过类似的\b描述叫做“Flow“\b，但是这种描述还是\b过于表面，\b这是一种基于经验在现象中的归纳，或者说只是在现象世界中对于这类情况观察后的总结，这种理论被约束在了一个人为定义的\b统一标准中，而且没有进行进一步的深入探索。那么时间在意识中如何存在和定义？和现象世界\b的线性系统如何关联？ 对于我们今天走入社会的大部分人而言，我们使用的数学知识还停留在西方三四百年以前的知识，甚至有些还是一千多年以前的\b\b定理。对于我们大部分人而言，最近三百年来的数学发展和\b应用我们似乎一无所知。 \b我早在\b两三年前的时候就在想一个问题，有没有一份工作，一两个人就可以做，不需要看客户脸色，受政府的政策影响小，对于参与的人都相对公平，工作的时间上和空间上不受限制，而且离钱够近。\b我查了很多个行业的资料，最终很有意思\b的发现这份工作居然是在股市，国人纷纷谈之色变的股市。而且我发现这里面不仅满足我所有的要求，而且这个市场离人性更近，在这里的人心境波涛汹涌又风平浪静。 为什么股市是相对公平？股市是股票被价格后自由买卖的现场，价格是各方力量的结果。各方力量的相对差异会在\b一个时间段内区别价格趋势，但最终都会在价格中反映，这一点对于每一个参与者都是公平的，价格属于所有参与者公开的共同的信息。股市对于人性的考验？价格不会欺骗人，真正欺骗人的是价格趋势。而对价格趋势的错误判断的人才会怨天尤人，然后自欺欺人的认为自己\b被欺骗。当参与者对价格趋势展开判断的那一刻起，就已经失去了抱怨的资格，因为贪婪已经从心底升起，时间只不过是一个验证的过客，结果会在参与者的不再判断中显示。 任何市场里最大的欺骗不是被价格\b欺骗，也不是被\b价格趋势欺骗，\b更不是被庄家和政府欺骗，最大的欺骗其实是自我欺骗。跌破持仓价时会安慰自己，已经\b到底部了马上就会涨回去的；涨起来的就会洋洋\b得意，还想着涨的更多。蠢货们永远不懂得买定离手和落袋为安。 \b价格趋势是可以预测的，在\b没有任何突发事件以及外界因素稳定的情况下（黑天鹅不用管，市场有足够强的自我修复能力），把价格趋势当成一个人，去感受她\b的情绪，对价格和量足够敏感，构建自己独特的态势感知。（态势感知可以用在很多行业，需要对未来进行预测和判断布局的行业里。这里的很多理论都可以拿出去用在专业行业。\b） 股市有哪些走势的知识？这里需要技术分析的基础。\b但是两个\b现代数学理论可以完美的用在这里，混沌和分形。 混沌是从物理学中发展而来。一些公认的特性，如初值敏感性（俗称“蝴蝶效应”）和奇异吸引子，实际上是确定性的非线性系统中出现的一种貌似随机的现象，混沌的奇妙之处在于把确定性和随机性这两个以前不相关的东西给统一了。混沌中行为总是会向阻力最小方向移动。分形是纯粹的几何数学知识，分形的核心是自相似，对于现实世界的很多貌似无规则的复杂现象，特别是在时间和空间上存在无穷迭代、控制和反馈机制的一些人工或自然的非线性系统，具有很强的描述能力，这其中包含了混沌现象。分形的奇妙之处在于以往看似无规则、碎片状的东西，其实也是有确定性规律的。（1） 这两点几乎可以完美的应用在价格趋势和K线图上。顺便说一句，\b本质这个世界上不存在投资，都是在投机。价值\b投资更是一则古老的寓言。 说了股市就顺带讲一点投资理财的小知识，进入社会后任何人都该有点理财观念，哪怕一个月只有几千块的收入，这个习惯越早养成越受益。首先，房子，如果不是刚需，这两年不推荐在一二线尤其是热点城市配置，现在的房价是进退两难，让子弹飞一会儿。理财产品主要配置股票、基金和活期。如果年收入超过十万，建议配置\b少量股票，A股直接选大蓝筹，买了放那不要乱动，放上几年再说。如果有心可以配置一些美股，主要配置一些科技股、银行股，\b持仓策略也一样，就当这钱扔了，过几年再看。至于什么\b时候把钱拿出来，这就是这几年里你学习金融知识的动力了。基金主要配置一些\bETF、股票基金和混合基金，不要配置货币基金和指数基金，\b收益太低，股票基金可以多配置一些，选择基金的方法\b\b就是\b对某一个行业方向的预期，看好未来某个行业的发展就选择对应的行业相关性的基金，剩下的\b行业信息收集，\b基金持仓配置全部交给基金经理去做。然后定投，看情况半年一次补仓，一年一次\b调整。剩下的应急使用的钱就扔活期里去吧。（这两种配置方法其实\b我都不喜欢，股市的资金\b这样放着能动性太差，\b资金利用率太低，国内基金\b规定一只基金对某只股票持仓不能超过固定比例，如果被玩了根本无法自保。） 语言（实际上是整个语音图像系统都有问题，被认为定义的\b定义需要一直定义）语言在诞生之初就是为了交流，即为了对\b有限信息\b的表达。所以语言是在认知之后，有了传播的需要才诞生出来。语言是对看见后的\b生理构建，即对选择后的有限信息的\b区别处理。这其中包含了两个过程，第一个是有限信息的保留，这个过程已经对整体看见进行了选择，第二是区别，区别是为了\b保留下语言能够处理的部分，然后不断组织，直到满足\b大脑的要求。语言在描述时存在有局限性，并且永远都有局限性，为了满足表达，语言必须不断的被创造，并且由于语言随着使用频率的语义会不断散失，语言永远难以\b准确的描述信息（比如帅哥美女）。\b\b意识和思维对于信息的处理速度越快的时候，人类的生理局限也会在语言上体现出来，即语言的表达\b常常跟不上思维的进度，甚至有时思维过于敏捷，语言上却是吞吞吐吐。语言的描述\b精度的散失和语言文字本身对于意识\b思维的匮乏，让信息的交换充满了混乱和困难，所以感同身受和心有灵犀虽然\b只有那么一瞬间，却让人觉得尤为珍贵，人生知己就更是万里挑一一生难寻了，那是一种知识面和理想的完美契合。维特根斯坦\b说：”语言的边界\b就是个人的边界。“尽管他很牛逼，但这个\b我是不同意的。 语言这个问题我要好好考察一下，这是今年的任务，这里还有个有意思的地方在语言之间翻译的问题。 人工智能：\b目前市场上对这一块的研究主要是在深度学习这一块上，我花了一个周末的时间看了大部分主流深度学习的算法和资料，说一下自己的看法。人工智能目前的还是更偏向于人工，而非智能。1）目前只是一种\b基于统计学的对于数据的聚合和\b归纳，而不是真正的能够理解数据。要想真正的智能，不仅是人为的调参数，更重要的是算法能够进化算法。当然，这个需要先有理论创新，因为变量太多。2）实际应用中算法导致的同质化严重。（比如某电商，我买个吹风机，会天天推送吹风机给我首页）3）数据大的，概率高的\b数据不一定就是好的数据，小概率的数据会被边缘化，但是小概率的数据未必就是不重要的。（比如金融市场）4）人工智能，包括神经网络的算法，最早的目的是为了模拟人类大脑的学习\b。但是目前的理论和算法都是基于\b经验式学习，而人类的学习方式还有很多别的\b学习方式。（比如启发式，推理式等）所以还有很大进步\b空间。5）数据是可以骗人的。所以我觉得人工智能目前的发展并没有媒体说的那么夸张，\b在很多领域的确可以节约成本，提高\b效率，甚至创新发展出新的商业模式。但是\b放到整个社会发展中去看，这个东西只能锦上添花，做不到雪中送炭，也就是说它做不到真正的变革。在实际应用的时候可以发挥其优势，但是也\b该对其局限性有所了解。数据会按照算法的参数去产出结果，但是这个结果\b如何被看待，还需要结合行业和\b需求来使用。越是数据是核心资产的行业可能越会遇到很多问题。 上面这些大概就是2017年所思所想的一些大纲性的\b描述，很多地方\b写的不太准确也不够细，后面会慢慢的修改和补充起来。还有就是这里的每一个\b模块，或者模块中的小模块都可以拿出来单独说，而且有很多内容可以说，可能也是需要今年做的事情。 \b说一些2018年吧。 2018年，索绪尔的《语言学基础教程》、海德格尔《存在与时间》以及《符号学入门》。然后会安排一些社会学和心理学的读物，如果有空会读一下\b黑格尔相关。还有一本欧洲史《耶路撒冷三千年》，\b买来好两三个月了，小说可能会读一下\b《三体》，\b剩余的\b偶尔会去书店看下当季畅销书，畅销书基本上一个下午就能翻一本，没什么营养，主要是收集下前沿信息。技术书籍准备了一本《Windows核心编程》《C#ViaCLR》，其它的待定，很多资料要在网上看更方便，比如paper、文档和博客。 最后熬点鸡汤，万一有人看的话。 人为什么会迷茫？绝大多数都是来自于对自身的毫无把握，所以各种感性的慰藉会乘虚而入（\b包括心灵鸡汤和朋友的关心慰藉），感性的东西往往不能够长久，此刻的感受往往在其它的氛围或者环境中就会降低甚至消失，所以想要不再迷茫，想要对自身能够把握，需要更多的诉诸理性————————不想写了\b，让庸人们庸人自扰去吧。 \b \b最后希望我们去读一些真正能让你思考的书籍，认识一些能够给你思维上启发的人，少在一些垃圾上浪费时间。就像不要去迷恋成功学，\b成功学\b告诉你如何成功，却不会告诉你成功之后干什么，也许并不会有什么不同，人生在世，看透了自然就了然了。 列个2017年书单\b 《西方哲学史》【英】罗素 \b这本书得了诺贝尔文学奖，罗素的主观观念很多，书中也铺垫了很多的时代背景知识，也有对哲学家本人的评价和介绍，推荐可以读一下。 《西方哲学史》【美】弗兰克·梯利 这本书梯利在康奈尔教书的大学课件，后来整理出版后被引入国内，现在也是很多大学的教材。比起罗素的\b书，这本书更加\b客观的介绍从苏格拉底到近代摩尔，对各个时代的哲学理论和体系进行梳理，主要是对哲学进行介绍和评价。 《天才之为责任——维特根斯坦传》【美】 瑞•蒙克 维特根斯坦，是\b出身在德国顶级富豪之家，尽管后来被罗素誉为天才，然而从小在其家庭里才能却并不突出，他的两个哥哥更是天才中的天才，可惜后来都自杀了。 这哥们挺逗的，家财万贯却需要别人接济生活，本可以体面的留在大学做教授，却忍受不了那帮\b蠢货跑去乡下教书去了，想自杀跑去战场打战，却在此期间把\b《逻辑哲学论》完成了，而且自己还没死。 《每天学点中国哲学》 胡适 这就是中国哲学史改了个名字而已，胡适做事全特么虎头蛇尾。 《逻辑哲学论》【奥地利】维特根斯坦 33岁时写了这本书，以一人之力把分析哲学推上了高峰，并且和现象学形成\b平分之势甚至更压一头。 《作为意志和世界的表象》【德】亚瑟·叔本华 叔本华的核心是生命意志，他自认为自己是康德真正的继承，但是又拒绝物自体的概念，他认为不存在不能被认识的事物。悲观主义是其伦理学的内容，是生命意志在现象世界 的一个立足点。但是他看的\b不够远，仅仅从个体生命的过程来看待\b生命，尤其\b是从生命\b的终点来向前看，自然一切\b终归是走向消失，但这不该是生命本就痛苦的理由。 《哲学史方法论十四讲》【中】邓晓芒 中国的\b文化不缺世界观\b\b和方法论，缺失的是对世界观的世界观和方法论的方法论，就算看了这本书你也不会明白的。 《你就是要很独特》【英】西蒙·布莱克 独特个毛 《自卑与超越》【奥地利】阿弗雷德·阿德勒 这是本家庭教育心理学的书啊，写的都什么鬼玩意。 《期货市场技术分析》【美】约翰·墨菲 股市技术分析入门书籍 《日本蜡烛图技术》【中】\b丁圣元 日本的K线看图法，全信你连裤衩都能\b亏了。 《证券混沌操作法》【美】比尔•威廉斯 很多人都说好，我没看出好在哪里。 《股票作手回忆录》【美】埃德温·李费佛 \b相当于自传，也挺有意思的，可以从里面学点操作心理。 《十年一梦》【中】青泽 上面基本都是股市操作技术技巧和操作心里书籍，想了解中国股市历史，看这基本就够了。 《中国空间》【中】李晓东 杨茳善 讲中国建筑文化的书籍，还行。 《我们内心的冲突》【美】卡伦·霍妮 \b瞎扯淡凑字数，你有个毛冲突啊。 《三国演义》【中】罗贯中 回头重看一下，修正一下网上那些人道听途说和人云亦云的东西。 《动物庄园》【英】乔治·奥威尔 政治讽刺，为了帮某研究生同学写论文看的。 《边城》【中】沈从文 初恋，懵懂的初恋，很美好\b。 《鬼吹灯》【中】南派三叔 三叔你可真特么能扯，你也扯完整了啊。 《UnityShader入门精要》 《深入理解计算机操作系统》【美】Randal E.Bryant / David O’Hallaron","link":"/2017/12/28/2017读书笔记/"},{"title":"今年你读过了哪些书","text":"2014年读过得纸质书籍，专业书籍类计算机图形学没有看完，涉及内容和数学知识太深了，我有重点的挑选了一些看了看，这个月打算把龙书看完（更新的时候龙书已看完）。 个人兴趣类： 《梦的解析》弗洛伊德 《穷爸爸富爸爸》【美】罗伯特-沙伦 《爱与孤独》周国平 《哲学的慰藉》阿兰德波顿 《思考，快与慢》【美】丹尼尔-卡尼曼 正在看—— 《影响力》【美】罗伯特-西奥迪尼 《苏东坡传》林语堂 《去你家玩好吗》韩寒 《黑天鹅》【美】纳西姆-尼古拉斯-塔勒布 《天才在左，疯子在右》高铭 《小王子》【法】安托万-德-圣艾克絮佩里 专业技术类： 《游戏开发与计算机图形学中的数学方法》 《游戏引擎架构》【美】Jason Gregory 《游戏设计开发课程-魔码》 《大话设计模式》程杰 《计算机图形学》 《Direct9.0-3D游戏开发编程基础》【美】Frank D luna 丹尼尔-卡尼曼《思考，快与慢》断断续续看了三个月了还没看完，这本书涉及的逻辑也很微妙，刚开始看了开头，作者写道在有些方面受到《黑天鹅》的影响，因为之前对《黑天鹅》就早有耳闻，所以当天晚上就先去买了本《黑天鹅》过来读。另外一方面的原因是，上面的这些书大部分都是我在上下班时在地铁上看完的，书中涉及的思考内容较多，逻辑推理也很严密，在地铁上实在难以有很好的环境来好好的思考，所以中间也停顿了一顿时间。 《梦的解析》《穷爸爸，富爸爸》《爱与孤独》应该都是第二遍到第五遍读了，所以稍微看起来快一点。 我买第一本《梦的解析》的时候是高二那年，在某个突发事件之后，莫名其妙的对心理学感兴趣了，虽然不知道为什么，但那时候就感觉这东西将会影响我的一生。这种感觉饿一直到大学，加入心协，到现在身边也常备一本《梦的解析》，本来还有一本马克-奥勒留的《沉思录》，但是送人了。 《穷爸爸，富爸爸》这本书是在厦门的时候在荒岛书店无意中看到的，随便翻翻就被书中的内容吸引，当时就毫不犹豫的买了下来。这本书算是对我的认识观有很大的影响，让我初涉资本理财知识，也是看完这本书之后让我对金钱的理解更加明白，从那以后我开始注意理财和注意对资产的收集和理解，是一本对我金钱观的有启蒙性教导的书籍。我记得当时一起买的还有《冰心诗集》，不过后来回来的时候冰心的书送给了房东的小儿子了。 《爱与孤独》《哲学的慰藉》《沉思录》都是哲学书籍，周国平是我最喜欢的中国哲学家，看看大哲学对爱与孤独两个对立而又互相存在是怎样理解的，看看大哲学家对女人和男人是怎样理解的，看看大哲学家对家庭和婚姻是怎样理解的，也是很有意思的事情。 《哲学的慰藉》讲述了欧洲古代几个著名的哲学家包括苏格拉底，蒙田，叔本华等的思考方式和生平，虽不是很全面，却正适合对哲学刚入门的新人来看。 《影响力》搞销售和营销的很适合看，我没有仔细的看，大概的翻了翻，看了个七八，整本书可以用苏州观前街寺庙里和尚骗烟火钱的过程来概括，很多内容虽然让我很厌恶，但自己用起来却很得心应手，你看，我们最后都会变成我们所讨厌的那种人，我最讨厌长得比我帅的，我还讨厌别人女朋友很漂亮。 《黑天鹅》这本书挺有意思，以后有时间可能会单独写篇文章来玩味，全书的主要观点就是关注不可预知的未来，黑天鹅的存在喻示不可预测的重大稀有事件，他们常常带来预料之外的重大冲击，但人们总是视而不见，并习惯以自己有限的生活经验和不堪一击的信念来解释他（个人觉得这就是宗教和哲学的意义，中国也许叫道德和良知），最终被现实击溃。我看完诺兰导演最近的新片《星际飞行》后最大的认识就是墨菲定律：一件事，只有存在发生的可能，那么就一定会发生。这句话同样适合这里。 《苏东坡传》讲述了苏东坡的一生，以前上学时不懂他的诗，都是瞎背，现在走入社会之后突然就懂了很多。“一蓑烟雨任平生”的快意恩仇，我喜欢上下雨天，最喜爱在蒙蒙细雨中行走，感受那点点凉意滋润在脸颊上，也无风雨也无晴。“我欲乘风归去，又恐琼楼玉宇，高处不胜寒。”心境之高，心胸之广，心灵之飘，人间已无再懂之人，一个人实在孤独，孤独时源自灵魂的感悟，起舞弄清影，何似在人间。“人有悲欢离合，月有阴晴圆缺，此事古难全，但愿人长久，千里共婵娟！”尽管人间很孤独，尽管你们都无法理解我，但有些事从古到今就是这样，大自然的规律就是这样啊，愿我们都可以过得很好，即便你现在远在千里之外。其实喜欢这本书，不仅是喜欢苏轼的人生哲学，也是因为这本书的作者，林语堂先生，这都比写的好多书都是在移居美国之后写的，而且第一版居然是英文版的，包括他最著名的小说《围城》，书中描绘的中国乡土风情都很细致和到位。 《去你家玩好吗》算是韩寒主编的《一个》的一个系列吧，青春文学还是好鼓励的，书中描写的大都是少男少女臆想的爱情，已经对经济快速发展的当下中国的描述，其实我们那一代人感受算是最清楚的了，十五年，变化太大了。 《天才在左，疯子在右》是一本精神病人访谈笔记，这本书买来只用了三天就读完了，因为加班，几乎每天都是10点以后才到家。看完以后又单独提了几篇单独的回味一遍，一个人对于世界思考的角度决定我们一生的很多东西。这本书买到后到看完估计都不到20个小时，书中涉及一些物理学，量子力学，时空观的东西可能一般人看不太明白。看完这本书我最大的感触就是我们看待世界的角度和人与人之间的交流以及对生命本质的思考。举个简单地例子，世界是物质的，这是唯物论的基础观点，那么情绪是如何传播的，情绪是一种什么样的物质，为什么在电话里我们可以感受到一个人的情绪？眼神是一种什么样的物质？它是如何传递信息的？是否可能被我们用来传递数据信息呢？为什么我们有时在第一次见到一个人的时候会有一种似曾相识或者认识了很久的感觉？时间是否是真实存在，流逝的究竟是时间还是我们？时间是不是只是一个用来衡量我们流逝的容器？ 《小王子》大人每天都在忙碌，吃穿住行，工作，下班，每天都在重复，但是他们很少有人知道自己这一切是为了什么。作者用一个孩子的眼睛去看待大人世界的一切，看着我们沾染种种恶习和盲目。","link":"/2015/01/27/Reading/今年你读过了哪些书/"},{"title":"《梦的解析》读书笔记","text":"一个心理学家必须有勇气承认自己的弱点 ###梦是愿望的满足 由于社会现实和伦理道德的限制，人的很多愿望和冲动都受到压抑。只有在睡眠中，当思想放松警惕时，这些愿望和冲动才会借助梦的形式表现出来，梦就是愿望的满足。 ###理智扼杀灵感 你能意识到的，都是你希望意识到的，不符合希望的意识，往往还没到达意识层就已经被扼杀。 心理治疗的过程就是放松理智、抑制批判力的过程，这样使你困扰的意念才会丝毫不漏的出现在你意识里，然后才可以对这些意识作合理的解释和找到解决的方法。 每个人都对暴露自己的精神细节持有抵抗，自我观察总比别人来的真切，所以我通过解析自己的梦来解析人类的精神世界。 ###潜意识、前意识、意识 潜意识是指人的本能冲动和被压抑的欲望，它是人类心理的基础和活动的内驱力，决定着人全部的、有意识的生活，它是处于意识之外的。 潜意识是有强度的精神力量，所以也被称为无意识，潜意识还分动力性和非动力性。被压抑的本能欲望是动力性潜意识，非动力性潜意识被称为前意识。 前意识是一种可以被回忆起来的过去的经验，它是临近意识但还没进入意识的、被压抑的欲望。 前意识处于潜意识和意识之间，担任稽查的任务，不允许潜意识本能和欲望侵入意识。潜意识很难或根本不能进入意识，而前意识则可能进入意识。潜意识要想进入意识必须要经过前意识的审查，借助于前意识的某种形式才能进入意识。 而意识只是心理的表层，是同外界接触所感知到的，稍纵即逝的心理现象。意识在精神活动中只占很小的一部分，其背后的潜意识才是心灵的主宰。如果心灵是一座冰山，那意识只是冰山一角，而埋藏在水下的大部分则是潜意识。 ###自我、本我、超我 自我处于本我和超我之间，遵循现实原则，它是本我和客观世界的调解人，既要执行本我的意图，又要满足超我的要求。 当本我无视外部危险，盲目追求本能欲求时，自我就会出现，控制本我过分的要求，并以一种合理安全的方式满足本我的需求。 如果自我过于放纵本我，触犯了超我的规则，超我就会以强烈的负罪感来惩罚自我。自我就是这样既要被本我所奴役，又要受到超我的限制，还要遭受显示的排斥。 本我代表着桀骜不驯的热情，自我代表理性和机制，超我则代表符合社会规范的、理想化的形象。 儿童是没有道德观念的，他们对快乐冲动的追求没有抑制的能力，超我的职责由外部力量来承担，主要靠父母的权威来行使。 父母一方面用爱，一方面用惩罚的方式管教儿童，惩罚意味着将失去父母的爱，为了自身利益，儿童必然会害怕这些惩罚，这种现实的焦虑就是日后道德性焦虑的开端。 只是到了后来外部的规范内在化了，超我才代替了父母，并开始监督并指导自我。 ###梦的改装 人的心灵分两个层面，第一个层面是愿望，第二个层面是理性。如果愿望和理性产生冲突，那愿望就必须经过改装，直到理性满意，愿望才能进入意识层。 有些梦之所以痛苦，是因为此种愿望不被理性所接受，并受到了理性的扭曲和变形后才得以通过，所以最后得到满足也是扭曲和变形的。 梦可以说是清醒状态时精神活动的延续，在梦中我们的愿望得到满足。","link":"/2015/02/14/Reading/梦的解析笔记/"},{"title":"Unity3D中的Path对应各平台中的路径","text":"iOS: Application.dataPath : Application/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/xxx.app/Data Application.streamingAssetsPath : Application/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/xxx.app/Data/Raw Application.persistentDataPath : Application/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/Documents Application.temporaryCachePath : Application/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/Library/Caches Android: Application.dataPath : /data/app/xxx.xxx.xxx.apk Application.streamingAssetsPath : jar:file:///data/app/xxx.xxx.xxx.apk/!/assets Application.persistentDataPath : /data/data/xxx.xxx.xxx/files Application.temporaryCachePath : /data/data/xxx.xxx.xxx/cache Windows Web Player: Application.dataPath : file:///D:/MyGame/WebPlayer (即导包后保存的文件夹，html文件所在文件夹) Application.streamingAssetsPath : Application.persistentDataPath : Application.temporaryCachePath :","link":"/2015/06/04/Unity3D/Unity3D中的Path对应各平台中的路径/"},{"title":"Unity3D中的单例类","text":"本文是我在Unity蛮牛上发的一个帖子，现在转到自己的博客上来。 这篇是我在逛国外论坛的时候看到的一篇讨论，内容的质量还不错，正好我在Unity蛮牛做翻译版块的版主，所以我就大概翻译了一下放到论坛里供大家一起学习讨论。 我们在做开发的时候，常常会一些类的变量进行访问和管理，有位程序猿就问：“在Unity3D中，有没有什么方法可以创建一个可以全局访问的单例管理类啊？然后这个类不需要我随时把它挂在场景中！” 然后有位技术大大就解答说：“这要看具体情况了，在Unity3D中一般有两种单例类！” 1、继承自MonoBehaviour，作为组件挂在GameObject身上。 2、不继承MonoBehaviour，作为一个单独的类。 下面是代码： public class MainComponentManger { private static MainComponentManger instance; public static void CreateInstance () { if (instance == null) { instance = new MainComponentManger (); GameObject go = GameObject.Find (&quot;Main&quot;); if (go == null) { go = new GameObject (&quot;Main&quot;); instance.main = go; // important: make game object persistent: Object.DontDestroyOnLoad (go); } // trigger instantiation of other singletons Component c = MenuManager.SharedInstance; // ... } } GameObject main; public static MainComponentManger SharedInstance { get { if (instance == null) { CreateInstance (); } return instance; } } public static T AddMainComponent &lt;T&gt; () where T : UnityEngine.Component { T t = SharedInstance.main.GetComponent&lt;T&gt; (); if (t != null) { return t; } return SharedInstance.main.AddComponent &lt;T&gt; (); } 这个类主要由两部分组成：一个是用于创建单例的静态方法CreatInstance（），还有一个是用于挂载组件类的GameObject，main物体。 使用范例： public class AudioManager : MonoBehaviour { private static AudioManager instance = null; public static AudioManager SharedInstance { get { if (instance == null) { instance = MainComponentManger.AddMainComponent&lt;AudioManager&gt; (); } return instance; } } 本来故事就到此为止了，于是本着分享的精神，我把我们之前技术中写过的一个单例类也拿出来分享给大家。 public class Singleton&lt;T&gt; : MonoBehaviour where T : Component { private static T instance; public static T Instance { get { if (instance == null) { instance = FindObjectOfType(typeof(T)) as T; if (instance == null) { GameObject obj = new GameObject(); DontDestroyOnLoad(obj); obj.hideFlags = HideFlags.HideInHierarchy; instance = obj.AddComponent&lt;T&gt;(); } } return instance; } } } 使用起来也很简单，下面是个例子： Singleton&lt;MonoBehaviour&gt;.Instance.StartCoroutine(routine); OK！这样就可以啦！有什么错误欢迎指出或者大家有什么好的建议也可以一起分享出来！","link":"/2015/01/26/Unity3D/Unity3D中的单例类/"},{"title":"Unity3D中自带事件函数的执行顺序","text":"在Unity3D继承自MonoBehavior的脚本中，有几个Unity3D自带的事件函数按照预定的顺序执行作为脚本执行。其执行顺序如下： 编辑器（Editor） Reset：Reset函数被调用来初始化脚本属性当脚本第一次被附到对象上，并且在Reset命令被使用时也会调用。编者注：Reset是在用户点击Inspector面板上Reset按钮或者首次添加该组件时被调用。Reset最常用于在见识面板中给定一个默认值。 第一次场景加载（First Scene Load） 这些函数会在一个场景开始（场景中每个物体只调用一次）时被调用。 Awake：这个函数总是在任何Start()函数之前一个预设被实例化之后被调用，如果一个GameObject是非激活的（inactive），在启动期间Awake函数是不会被调用的直到它是活动的（active）。 OnEnable：只有在对象是激活（active）状态下才会被调用，这个函数只有在object被启用（enable）后才会调用。这会发生在一个MonoBehaviour实例被创建，例如当一个关卡被加载或者一个带有脚本组件的GameObject被实例化。 注意：当一个场景被添加到场景中，所有脚本上的Awake()和OnEable()函数将会被调用在Start()、Update()等它们中任何函数被调用之前。自然的，当一个物体在游戏过程中被实例化时这不能被强制执行。 第一帧更新之前（Before the first frame update） Start:只要脚本实例被启用了Start()函数将会在Update()函数第一帧之前被调用。 对于那些被添加到场景中的物体，所有脚本上的Start()函数将会在它们中任何的Update()函数之前被调用，自然的，当一个物体在游戏过程中被实例化时这不能被强制执行。 在帧之间（In between frames） OnApplicationPause：这个函数将会被调用在暂停被检测有效的在正常的帧更新之间的一帧的结束时。在OnApplicationPause被调用后将会有额外的一帧用来允许游戏显示显示图像表示在暂停状态下。 更新顺序（Update Order） 当你在跟踪游戏逻辑和状态，动画，相机位置等的时候，有几个不同的事件函数你可以使用。常见的模式是在Update()函数中执行大多数任务，但是也有其它的函数你可以使用。 FixedUpdate：FixedUpdate函数经常会比Update函数更频繁的被调用。它一帧会被调用多次，如果帧率低它可能不会在帧之间被调用，就算帧率是高的。所有的图形计算和更新在FixedUpdate之后会立即执行。当在FixedUpdate里执行移动计算，你并不需要Time.deltaTime乘以你的值，这是因为FixedUpdate是按真实时间，独立于帧率被调用的。 Update：Update每一帧都会被调用，对于帧更新它是主要的负荷函数。 LateUpdate：LateUpdate会在Update结束之后每一帧被调用，任何计算在Update里执行结束当LateUpdate开始时。LateUpdate常用为第三人称视角相机跟随。 渲染（Rendering） OnPreCull：在相机剔除场景前被调用。剔除是取决于哪些物体对于摄像机是可见的，OnPreCull仅在剔除起作用之前被调用。 OnBecameVisible/OnBecameInvisible：当一个物体对任意摄像机变得可见/不可见时被调用。 OnPreRender：在摄像机开始渲染场景之前调用。 OnRenderObject：在指定场景渲染完成之后调用，你可以使用GL类或者Graphics.DrawMeshNow 来绘制自定义几何体在这里。 OnPostRender：在摄像机完成场景渲染之后调用。 OnRenderImage(Pro Only)：在场景徐然完成之后允许屏幕图像后期处理调用。 OnGUI：为了响应GUI事件，每帧会被调用多次（一般最低两次）。布局Layout和Repaint事件会首先处理，接下来处理的是是通过Layout和键盘/鼠标事件对应的每个输入事件。 OnDrawGizmos：用于可视化的绘制一些小玩意在场景视图中。 协同程序（Coroutines） 正常的协同程序更新是在Update函数返回之后运行。一个协同程序是可以暂停执行（yield）直到给出的依从指令（YieldInstruction ）完成，写成的不同运用： yield：在所有的Update函数都已经被调用的下一帧该协程将持续执行。 yield WaitForSeconds：一段指定的时间延迟之后继续执行，在所有的Update函数完成调用的那一帧之后。 yield WaitForFixedUpdate：所有脚本上的FixedUpdate函数已经执行调用之后持续。 yield WWW：在WWW下载完成之后持续。 yield StartCoroutine：协同程序链，将会等到MuFunc函数协程执行完成首先。 销毁（When the Object is Destroyed） OnDestory:这个函数在会在一个对象销毁前一帧调用，会在所有帧更新一个对象存在的最后一帧之后执行，对象也许会响应Object.Destroy 或一个场景关闭时被销毁。 退出游戏（When Quitting） 这些函数会在你场景中所有的激活的物体上调用： OnApplicationQuit：这个函数在应用退出之前的所有游戏物体上调用，在编辑器（Editor）模式中会在用户停止PlayMode时调用，在网页播放器（web player）中会在网页视图关闭时调用。 OnDisable：当行为变为非启用（disable）或非激活（inactive）时调用。 脚本的生命周期流程图：","link":"/2015/02/13/Unity3D/Unity3D中自带事件函数的执行顺序/"},{"title":"Unity3D动作类游戏中两种相机抖动","text":"在动作类RPG游戏中，为了体现角色的技能和增加动作打击感，我们常常会给相机添加抖动效果来配合特效做一些技能效果。我在网上搜了一下，然后结合自己的项目总结一下，大概分两种抖动， 按次数抖动按次数抖动，就是让相机抖动固定的次数。但在实际项目中，我们为了防止抖动效果过于生硬，一般会给一个次数的范围，然后随机生成抖动的次数，这样玩家在玩的时候就不会感觉很重复。 using UnityEngine; using System.Collections; public class ShakeCamera : MonoBehaviour { public Camera curCamera; bool isCanShake = false; int shakeCount = 0; Vector3 mCurPos;//相机的初始位置 float radio = 0.2f; // Use this for initialization void Start () { //ShakeCameraWithCount (); } // Update is called once per frame void Update () { if(isCanShake) { } ShakeWithCount(); } void OnGUI() { if(GUI.Button(new Rect(0,0,100,40),&quot;ShakeWithCount&quot;)) { ShakeCameraWithCount(); } } public void ShakeCameraWithCount() { mCurPos = curCamera.transform.position; shakeCount = Random.Range (5,14); } void ShakeWithCount() { if(shakeCount&gt;0) { shakeCount--; float r = Random.Range(-radio,radio);//随机的震动幅度 if(shakeCount == 0) { //保证最终回归到原始位置 curCamera.transform.position = mCurPos; } else { curCamera.transform.position = mCurPos + Vector3.one*r; } } } } 按时间抖动按时间抖动，顾名思义就是让相机在给定时间内一直持续做抖动效果。按时间抖动不仅可以用作技能效果，而且可以用来模拟地震，巨石落下等自然效果，这样既可以节省美工的工作量，又能节省资源，而且效果还很真实。全部代码就不发了，只发一部分核心代码： void ShakeCamera_Time() { if (shakeTime &gt; 0) { mainCamera.transform.position = mCurPos + Random.insideUnitSphere * radio; shakeTime -= Time.deltaTime * deFactor; } else { shakeTime = 0; //mainCamera.transform.position = mCurPos; } } 只要放在Update里执行，然后从外部传入震动的时间就可以看到效果啦！ 如果有更好的方法欢迎补充(⊙o⊙)嗯！","link":"/2015/01/29/Unity3D/Unity3D动作类游戏中两种相机抖动/"},{"title":"Unity4.6.2更新日志","text":"这一篇是Unity3D4.6.2刚发布的当天晚上，受Unity蛮牛委托翻译，当时翻译完成时已经是凌晨一点多，然后就赶紧发邮件给蛮牛管理员那里，当时也没有来得及校对。 这两天忙过来，有时间又修改校对了一下，然后发在这里，有错误的地方希望可以告知改正。 原文链接：Unity3D 4.6.2发行说明 Unity4.6.2发布给你带来了一些改进和修正。阅读下面的发行说明，了解更多细节。更多信息关于之前的主要发布，请看Unity4.6发行说明。 新的特性（Feature）：使用il2cpp支持iOS64位发布。 内容更改（Changes）：从这次发行的版本开始对Flash平台的发布将不再支持。 一些改进（Improvements）：Audio：添加了WWW.GetAudioClipCompressed方法。允许通过WWW类来获得AudioClips，然后将被加载内存里压缩，类似于”压缩进内存“的导入选项。 Graphics：添加了MaterialPropertyBlock.Set*() 方法，用来重写当前存在的一个MaterialPropertyBlock 中的的值，而不是重复添加。 iOS：添加了基本的进入界面支持。 iOS：暴露了”set pause“作为ObjC的API。 Linux：为Latin和CJK添加了更多的字体fallbacks 。 Oculus GearVR：启用低延迟音频支持。 Oculus Plugin：Oculus的未来版本插件将不再需要Direct_To_Rift.exe。 Oculus：在Unity免费版里添加了splash Screen。 Scene View：现在DrawGizmo 属性使用不正确的时候会报错，并且有更好的描述。 Standalone： Screen.dpi在OSX和Windows独立平台上实现。 UI：更改Text.m_Text为protected，Text.text 为virtual。当用户用这种方式扩展文本时，可以控制文本内容。 UI：暴露 EventSystem.firstSelected到API。 WebPlayer UnityObject：现在可以加载内容之前识别Web播放器运行的版本。这使得能够根据运行时不同的版本加载不同的内容。 修复（Fixes）2D：当用户通过SpriteEditor创建sprites的时候，现在被强制拥有唯一的名字。 2D：修复PolygonCollider2D 在安卓平台上的网格生成。 2D：sprite Trim热键“T”不再干预sprite命名。 2D：单个sprite pivot现在将会被正确的保存在 Sprite Editor。 2D：Packing（填充精灵）之后Sprite Packer页面列表现在将会刷新。 Android：安卓TV并不真正的需要加速度机和麦克风。 Android：修复空引用导致的崩溃。 Android：修复windows上32位Java环境里发布失败。 Android：修复Android Lollipop版本的CJK字体。 Android：修复在硬件统计代码里可能导致的崩溃。 Android：修复当过早调用UnityPlayer.pause() 的僵死。 Android：修复在一些亚马逊Kindle设备上启动时程序卡住。 Android：修复当App没有暂停时焦点变化时程序卡住。 Android：修复Android Lollipop上日文Kana 字体。 Android：修复Android Lollipop上lights-out模式。 Android：修复当在Unityplayer中紧急调用暂停/恢复时可能无法启动。 Android：为了在启动期间隐藏标题栏，修复默认的menifest文件中theme 属性。 Android：增加了当发布安卓平台的时候，Java可用的最大内存。 Animation：Animation窗口不会因为第二个Monobehaviour事件而显示’Function not supported’。 Animation：不要在AnimatorOverrideController暴露一个源Clip的多个条目。 Animation：Optimize 和DeoptimizeTransformHierarchy在运行时可以像编辑器里一样使用。 Asset Import：导入的assets现在正确的更新项目标签数据。 Asset Import：恢复之前AssetModificationProcessor.OnWillSaveAssets的行为，忽略空或无效的返回值。 Asset Import：重新序列化从工程的Force Binary / Force Text序列化设置的.unitypackage assets。 Core：修复当RectTransform.GetWorldCorners被使用不正确的参数调用时的错误信息。 Core：PPtr 动画现在能正确触发OnDidApplyAnimationProperties的回调。 Editor：当模型没有被打开编辑的时候允许查看所有的模型导入选项。 Editor：修复使用XRGB颜色格式导入的DDS贴图。 Editor：修复了一个Bug，如果有一个Vector2的一个坐标改变了一个没有修改，修改RectTransform 将会错误的标记场景。 Editor：修复一个FormerlySerializedAs属性有点相关的内存连接。 Editor：修复当选择多个对象时没有任何行为时，导致UnityEvent 对象自我引用改变 。 Editor：修复当销毁多个参数时编辑器的滞后性。 Editor：修复当有子帧关键帧的时候下一个/之前动画关键帧导航。 Graphics：当使用OpenGL ES 3.0.一些GPU驱动工作导致的奔溃。 Graphics：修复在支持NEON的平台使用动态批处理的时候可能的内存泄露。 Graphics：修复D3D9处理不支持BGRA32位贴图格式可能回滚到ARGB32。 Graphics：如果所有输入的贴图是ARGB4444/RGBA4444 ， Texture2D.PackTextures将会输出 ARGB4444格式的图集。 iOS：不在iPhone6+的手机上旋转splash视图。 iOS：确定Input.touches在一帧里是不改变的。 iOS：修复在iOS8+的设备上第二舞台上splash方向。 iOS：修复当text field内容通过脚本改变或撤销使用导致的奔溃。 iOS：修复OpenGL ES回缓冲区大小的决定（修复iPhone6+ zoomed模式）。 iOS：修复iOS8.0本地通知，你该在调NotificationServices.RegisterForLocalNotificationTypes之前 安排好第一次通知。 iOS：修复如果从控制台发布iOS弄乱终端设置。 iOS：修复辅助显示屏上的图像歪斜（AirPlay）。 iOS：修复当iPhone6上splasesh出现时Xcode5的splash Screen检测。 iOS：修复Xcode6.2支持。 iOS：添加iOS上栈分配大小。 iOS：在iOS设置没有备份标识在_info缓存文件。 iOS：当程序上的材质被使用注册SubstanceArchive 。 iOS/IL2CPP：为数组类型正确的发出方法，属性，字段和事件的数量。 iOS/IL2CPP：明显的减少由代码生成的警告数量。 iOS/IL2CPP：修复Armv7链接器错误（”b/bl/blx ARM branch out of range” ）。 iOS/IL2CPP：修复反映在自定义属性上的崩溃。 iOS/IL2CPP：游戏中心导航现在启用。 iOS/IL2CPP：修复为开放式泛型类型派生自UnityEngine.Object生成不正确的代码。 iOS/IL2CPP：修复反射代码的内存泄露。 iOS/IL2CPP：修复在固定条件内实现反射。 iOS/IL2CPP：当不应该被剥离的类型被发现，忽略不在UnityEngine命名空间内的管理类型。 iOS/IL2CPP：BinaryFormatter 串行现在起作用。 iOS/IL2CPP：生成的C++代码现在更加易读。 iOS/IL2CPP：下限为0创建的数组像SZARRAY 一样对待。 Linux：使设备的唯一标识符更连贯。 Mac OS X Standalone：玩家发布版本去除标识符。 MonoDevelop：生成解决方案包括“indent size”指令匹配标签大小。 Oculus Plugin：修复GearVR Unity Pro + Android Basic license问题。 Physics 2D：HingeJoint2D gizmo 正确的显示在任何引用的角度。 Physics 2D：EdgeCollider2D的改变可以保存在被使用的预设上。 Physics 2D：直接设置Rigidbody2D的位置和旋转角度现在唤醒Body。 Physics 2D：当连接到其它 Rigidbody2D时，SliderJoint2D &amp; HingeJoint2D的参考角度立刻重新设置。 Physics 2D：静态 2D 碰撞标志立刻渲染在正确的 Transform组件Z轴位置。 Scripting：修复当使用StopCoroutine(Coroutine).时一个无害但恼人的错误信息。 Scripting：修复Console.InputEncoding 和 Console.OutputEncoding 抛出一个异常，当第一次被设为.NET2.0 Subset Profile。 Shaders：修复在Shader错误报告时编辑器内存泄露。 UI：在可被选择的组件改变任何Transition 设置立刻放映在场景或game视图中。 UI：修复一个bug,使用用户自定义字体导致错误的Y轴光标定位在TextField里。 UI：如果ScrollRect内容大小被零除，有零的宽或高。 UI：修复添加或移除一个父canvas将不会更新父canvas子对象的依赖关系的问题。 UI：修复键盘不会显示在移动设备上的问题。 UI：修复在一些例子中当使用多个GraphicRaycasters，回归的事件被发送给错误的对象。 UI：确认我们复制指针进入右或中鼠标指针当我们取它们的时候。 UI：把EventSystemEditor 从UnityEditor.UI 命名空间移到UnityEditor.EventSystems命名空间。 UI：防止“/n”出现当重新使用一个 不能调用的input-field。 UI：透明边界的切片图片非默认pixelsPerUnit正确的运转。 UI：当激活standaloneInputModule 不要设置选择元素为空。Version Control：修复拖拽Asset在变化列表之间只要移动一个单独的Asset。 Windows Phone8：现在有特殊的不会被处理的插件就像在WindowStore里的app。 Windows Phone 8.1/Store Apps：修复一个在Unity脚本中有时导致抛出MissingMethodException 在 Boo.Lang.dll深处 导致casting arrays问题。 Windows Phone/Store Apps：修正了由蒙皮网格引起了罕见的崩溃。 WWW：修复在WWW 缓存bug，当使用WWW.LoadFromCacheOrDownload 被使用 WWW.Dispose 取消时。 以上，我把一些相对重要，对我们平时做项目影响较大的条目做了醒目的标示。","link":"/2015/02/04/Unity3D/Unity4-6-2更新日志/"},{"title":"一路走来","text":"曾经以为身边有人陪伴便不在孤单，可笔尖的文字总在不经意间流淌。我管它不住，便放任他在一旁，随它静静的流浪。 一路走来，身边的人来了又去，分不清曾与谁对敌，分不清谁才是知己。 不知在哪个人生的岔路口，我们都选择了自以为是的路而去。可我们的路太长太远，几乎没有几条可以，相交再让我们相遇。 蜷缩在墙角的回忆，我们忙碌的已经来不及，重新把它拾掇起。满满的灰尘，好久好久，没有人清洗。 曾经温暖的被窝里，一起分享过彼此的秘密；一起搜罗而成的邮集，也不知被放到了哪里。 多年后再次相聚，便只有一笑，却再无一语。回想起过去，心中不由多了几分惆怅和惋惜！ 当阳光和发丝的味道缠绵在一起，清馨，明丽。懒洋洋的总让人幻想，幻想过去和未来的甜蜜，美好的让人想哭泣。 午后的雨滴，渗透了厚实的空气落入了我的眼里，一道彩虹映射出刹那间的美丽，给了我太多的惊喜。 我曾想抓住一把阳光放入嘴里，打个饱嗝，陶醉般的把眼睛眯起，可我又怕因此窒息。 一路走来，身边的人来了又去，一路都是陌生的气息，一路都是遗失的记忆。 想来才发现，还是时间调皮，似个精灵。总在你身边飘荡游离，当你想要拥抱它时，他却已经离去。 黄昏下的校园里，少女的体香在小路和楼梯上飘逸，少年在操场上释放着青春的气息，花园里一道道相交而又相离的轨迹…… 嘴角的胡须和喉咙的隆起见证了桃花的开了又去。 于是，我便就此搁笔。","link":"/2012/03/26/凡尘集/一路走来/"},{"title":"小傻瓜","text":"在黑夜中伸出我们的双手，抓住的除却时光，就只有记忆了。枕着梦再去仔细回味时，才明白那种依偎着的甜蜜的感觉是多么的幸福，多么的让人留恋。就连思绪沾染到的许些清愁，也化了许多开去。 小傻瓜曾傻傻的对我说：“我可能再也找不到可以骗我一辈子的男人了！”我笑了笑说，要是实在找不到了，你就再回来找我吧！呵呵，笑的那么有气无力，小傻瓜那么傻，谁会忍心去骗你啊，疼你还来不及呢！ 小傻瓜其实并不傻，她只是想有那么个人溺爱般的宠着她！ 曾看过一张小傻瓜以前的照片，那时的她有着一张干净、纯真的小脸蛋。那时的她还没有现在这般可爱的婴儿肥！现在的小傻瓜有一张圆圆的、肉嘟嘟得小脸，还有一个可爱的小下巴，粉嫩粉嫩的！ 吃是小傻瓜的最爱，她吃东西时那种陶醉的表情总是能影响到我。呵呵！每次看她吃东西自己都会忘了吃，每次食物到了嘴边她都会微微的眯起他那双水汪汪的大眼睛，然后嘟起粉嫩嫩的小嘴，轻轻地咬上去，每咬一口都会露出微微有些享受的傻傻的笑，然后闭上眼睛满脸都是陶醉。 呵呵！如果此时在有些细细碎碎的阳光透过树叶的缝隙洒在她那张白白净净的小脸上，那一定像个天使般晶莹好看。 除了爱吃小傻瓜还喜欢的就是睡觉了，小傻瓜每次坐车，只要上了车没多久就会打起哈欠，然后就犯起小迷糊。 最美的就是躺在草地上时了，透过周围的树叶丛看着蓝天白云，看着看着某傻瓜就在我的身旁肆无忌惮的睡了开去。小傻瓜睡觉的时候不喜欢有光，所以她躺下一会儿后就毫不客气的抓住我的大手放在她的眼睛上，然后就心安理得的继续睡。呵呵！虽然有些自欺欺人的傻，不过她喜欢，我也就懒得过问。 或许小傻瓜自己都不知道，在她睡着的时候身体总是会莫名其妙的颤抖。我只有温柔的拍拍她的后背，轻轻地安抚她那个自己都不知道做成什么样子的惊慌失措的梦。待她安静下来时，再看看她那如婴儿般均匀的呼吸，呵呵，好像就要流口水了！ 小傻瓜有一个愿望，希望将来能有一个属于她自己的家，一个古堡式江南田园小庭院。每天早上吃饱了以后，伸个懒腰，然后揉揉自己圆滚滚的小肚子。意犹未尽的爬上那张柔软的大床上，一边哈哈哈哈的傻笑一边来回打滚。 等再长大些小傻瓜希望能有一间婴儿房，小傻瓜说过，她想要个双胞胎，最好是龙凤胎。小傻瓜曾挥舞着小拳头，咬着小米牙恨恨的说：“哼！凭什么别人一生就是龙凤胎！”说完就转过头伸手过来掐我的腰，嘴里还嚷嚷：“混蛋！你笑什么笑啊！”我一边笑着躲开一边想，到时两个小家伙一定有他妈妈那样又黑又亮的大眼睛和又嫩又圆的小脸蛋。那时估计任谁都会忍不住想伸手去捏几下吧，那小模样，一定可爱极了！ 小傻瓜淘气的时候会色色的看着我，然后眼角含春的抛一个媚眼过来，伸出食指对我勾了勾。然后我就会会意的露出一个“你的意思我已收到”的表情，用一种大灰狼看见小红帽的神情走近她。一靠近后，她立马换上一脸戒备的表情，然后用无辜的眼神看着我，那意思好像在说“你欺负我我就喊人喽！”，还配合似地弱弱的用双手抱着肩。我无奈的只能溺爱的刮刮她的小鼻子。 呵呵！或许在某个阳光明媚的午后，小傻瓜调皮的蹬开被子，然后揉揉惺忪的睡眼，用一副倍加慵懒的声音对着坐在窗口看书的某人说：“小哥！你过来呀！”说不定还会送上一个妩媚的眼神。等那某人上当过来以后，小傻瓜定会毫不留情的一脚把他踹下去。然后你一定会听到一个如银玲般的笑声肆意的飘在那个爽风习习的午后，奸计得逞。 小傻瓜很少会哭，可能因为她早就知道了哭泣是没有用的，所以她总是爱笑，有时甚至会笑得如爱上一个人那般的没心没肺。可那笑声的背后分明颤抖着莫名的忧伤，只不过是被暂时的明媚所掩盖。 “你说我到底有没有长大啊？”小傻瓜有时会歪着小脑袋这样天真的问我，也许也是在问自己吧！其实在我眼里，小傻瓜就是小傻瓜，永远都是个长不大的淘气包。 小傻瓜喜欢小狗刀刀，以为仰起头泪水就能倒回去。嗯，小傻瓜应该是常常都把泪水流回心里去得吧。大概只有趁着夜色的宽容，伴着夜的呼声，她才会默默的流下泪水的吧！ 小傻瓜其实挺爱玩的，一见着玩的东西，眼神里就会闪烁着一种光芒叫蠢蠢欲动，然后接下来还有一个挥着小拳头的动作叫跃跃欲试。 小傻瓜应该是常常想家的吧。想家里的青山和绿水，想家里的家人和朋友，想家里的小吃和她那个温暖的小窝。小傻瓜说过，她的家乡在一个很远的地方，有许多山啊水啊，反正啊，就是很美很美的那种。小手边说还边比划着，然后扭过头来戳了下我的脑袋，你个白痴不懂什么叫美，以后带你去看。嗯嗯，我不懂，要不也不会看上你这个傻姑了了，然后会听到某人被掐的惨叫声传出天边……。 还记得记得那天晚上小傻瓜对我说：“以后别再来找我了！”。我说，那起码来个吻别吧！小傻瓜左右看了看没什么人，当她准备好的时候，我却放弃了。我还没准备好，没准备好就这样分别了，所以我吻不下去。我知道她是放不下我的，就想我放不下她一样，但我依然答应了她这个无理的要求。 我记得我走的时候头也不回，我不想小傻瓜看到我落寞的样子，因为只有她不在我身边时才最落寞。 小傻瓜的签名里一直都有一句话，有时候就连思念一个人都有着傻傻的幸福。小傻瓜，我想你了…… 2011年9月13日做最后一次修改，文章大概写于两个月前。 2012年3月26日逃课无聊中整理","link":"/2011/09/13/凡尘集/小傻瓜/"},{"title":"梦之篇章","text":"楔子 远古时期，天外天有三大诀：不灭，忘情，轮回…… 须弥山，介子洞，藏书阁，古籍翻过几千卷。你踏着尘缘，印证着时空的巧合，拨花折柳，款款而来。 我转过身，抽出剑，削削斩斩，只为修正我的倒影，以为这样便可以与你相合相依。 阡陌梨花白，寂寞落尘埃。 直至那日，你叫人给我递来一块粉荷绿边的绣花手绢。娟秀小字，绣在当中，针针有心，字字无情。 第一卷 梦之邂逅语碎，我本来是追着梦来寻觅这江南的烟云淡柳的，可是不知是巧合还是注定，命运偏偏让我在这里遇见你。 那日，碧瓦青砖，小桥流水。你一个人，素颜青丝，柳眉玉鼻。碎花走闲步，轻轻地绽放在这古朴的青石小径上。那微蹙的眉头，似在思考着什么，又像是在寻找着什么。可看在别人的眼中，心里却是没由来的一阵疼惜！ 然后你就这样幽幽的，迈着梨花小步，走入那结满青苔的乌蓬小巷中，消失不见。 我伫立在桥头，目光追逐你的脚步消失在心的尽头。 从那刻起，我好像听到了尘封已久的心的呻吟。 从那日起，红尘不理，心有所系，就连散落在风中的笛音也多了了一丝丝自以为是的情意。 日日常念风添愁，捡了时光，拾了红豆，心上相思结了垢。 再见你时是那骤雨初晴的小湖边，你一身素白，皓月纺纱。纤长的玉指，轻轻拨弄着那株清水凝露，含苞欲放的粉头玉莲。 我站在不远处的凉亭中，痴痴的望着你。 你理了理那几根跳脱出双鬓的柔发，轻轻地转过头来。在目光相迎时，你眼睛里闪过了一丝惊讶，随即淡然！ 我看着你的眼睛，妄图用水的温润柔你那颗未知的心。你却不抬眼睑，轻轻地将我的自作多情划了开去。 唇开无语。 你是从寂寞深处生长出来的冰心古莲，孤高在上，不染纤尘。 我是万叶青葱中劲枝向上的悠然青竹，节节攀高，却始终够你不到。 你以你的天性敲开了我封尘的心，我却拨不开迷雾沾染到你的情。 那日，玉清之上，太上老君寻我而来，欲助我得道成仙。他字字珠玑，头头是道，你本就不是凡尘之物，故而不会得到俗世之情，随我成仙去吧！ 我娓娓苦笑，轻轻摇首，成仙有什么好，增得许些寿命。没有爱，不过是徒增几千年寂寞而已。与其如此，我宁可孤守在竹林边，看孤云排遣，陪落红老去。 第二卷 梦之执手当我再去寻找时，你已渺无踪迹。我拖着疲惫的心，沿着你走过的路走回去，回到我第一次见到你的地方。 “傻子！看呆了么？”看你如莲花般绽放的一笑，我心底颤了又颤，想逃却无处可逃，只能陪你呵呵的傻笑。 然后你又羞涩的抿着嘴，害羞的样子，不胜迷人，艳煞我心。 “我终于找到你了！”我不知道这是你的唇意还是我心中的呓语。 孤心逆旅，寻求不到心的超然，便不愿再回。奈何在这里却将心搁浅。 素梅傲得了寒冬的冰冷，却耐不住春风的多情，我宁愿将自己沉沦给你。 你弱弱的依偎在我怀里，说我不该动情。可遇到了你后，我就已经控制不住自己了。 我说可能是你哪世欠我的吧。 你说我推演了轮回，却始终没有找寻到我关于你的那一章。 我说，怪我，将你的美散落在这江南，引人觊觎。 你说，我常常看到月端有人，那身影好熟悉好熟悉，然后你会转过脸来问我那是不是你。 我没有说话，只是静静的看着你，今天，你真美。 你说，好久都没去看那些小东西了！ 我说，是放生池的相思鲤么。 你说，对啊，我经常一个人在那边看鱼儿跳！经常一个人去的！ 我看着你，却看不破你的身影！可是它却如此的单薄。 我说，那我以后都陪你去看鱼儿跳。 你看着我的脸庞，然后又看着我的眼睛。然后把头埋在我怀里，乖巧的答应了一声，扭了扭身子，安静的睡着了。 月，夜轻轻地拂来，观音古莲盛放异彩。 唉！情关是世人看不破的孤单！何必固守执念，何不放下成佛。 我说，那你呢!苦修千年，仍就未能成佛。菩萨，菩萨，菩提萨陲，难道也是情字难堪吗？ 观音不语，执掌净瓶，略蹙眉头，隐隐淡去。 第三卷 梦之莫忘我曾向往的是在那时空倒转的江南、排云鹤起，然后一起徜徉在诗雨云韵中的爱情，可你却把我的爱放到了江南以南。 清明时节雨纷纷，路上行人欲断魂。 细雨淋了谁的雨伞，又湿透了谁的灵魂，而又成全了谁的望眼欲穿。 油纸伞下我又一次目送了你的离开,可是我没想到这竟成我们短暂相依后的亘古相离。 你修的是忘情，以无情来渡痴情，可若是为爱堕入无间，就只能成就永世无依的绝情。 我修的是轮回，世世寻找，生生分离，只为那一次就已确定的执手，相约不弃。 隔帘听雨雨更愁，莫道相思，白了少年头。 若爱是一场擦肩而过，那为何冥冥之中又让我们今生相遇呢？又或许相爱的目的是为了相离？或许吧！谁又能知晓呢！ 是谁打翻了云得悲哀，零落成雨，片片泼洒而下，我躲闪不及，任是让灵魂被淋个湿透。 你的可笑是如此孤单，以为不见便能相忘。 你用情的刃，将缘的分生生的割开在心的两岸。任时间的水冲刷着错落的伤口，疼痛不去安抚。 如果还有来生，我再也不愿与你相见，因为你这一世就已经煞了我相思的念。 一生都为了一个情字煎熬，仗剑走红尘，却枉自称大侠英豪，可笑，可笑。 竹林中，夕阳下，坐守碧青小湖边，一舍编竹小筑。我在此画地为牢，一个人在牢中慢慢变老，时时对自己诉说着你的好。 我刨开心的世界，在一个熟知的角落，留一片爱的净土，等你归来。 无根树，花正幽，贪恋红尘谁肯修？浮生事，苦海舟，荡去飘来不自由。无边无岸难泊系，长在鱼龙险处游。肯回首，是岸头，莫待风波坏了舟。 是夜，云端幽幽地传来了梵唱佛音，可笑，又来渡我。我将爱全心付出时，就已经将灵魂出卖给了自己。 在花与雨错落的时空，雪泥鸿爪成就一路飞花。在山与水的两岸，依稀间还可以听到旋与律的孤单。 第四卷 梦之难分醒来时，眼角的泪依然温热，初晨的阳光从侧面混合着泪水毫不客气的浇在我的脸上。碎落的光线从指间滑落，伸出手去，十指相扣，光影重叠却绝不重逢。 嘴边的唇印让我对梦与否难以分清。 依稀间，你轻抚我的眉，樱唇轻启，要浓些，再细些就更好看了。我哽咽无语，唯有痴痴的看着你。","link":"/2012/11/03/凡尘集/梦之篇章/"},{"title":"Unity中Layer和LayerMask解析","text":"Unity中是用int32来表示32个Layer层。int32表示二进制一共有32位（0—31）。 在Unity中可编辑的Layer如下图所 在Unity中每个GameObject都有Layer属性，默认的Layer都是Default。在Unity中可编辑的Layer共有24个（8—31层），官方已使用的是0—7层，默认不可编辑！ LayerMask实际上是一个位码操作，在Unity3D中一共有32个Layer层，并且不可增加。 ###位运算符###按位运算符：~、|、&amp;、^。位运算符主要用来对二进制位进行操作。 逻辑运算符：&amp;&amp;、||、！。逻辑运算符把语句连接成更复杂的复杂语句。 按位运算符：左移运算符&lt;&lt;，左移表示乘以2，左移多少位表示乘以2的几次幂。 举个栗子： var temp = 14 &lt;&lt; 2; 表示十进制数14转化为二进制后向左移动2位。 temp最后计算的值为 14乘以2的平方，temp = 56； 同理，右移运算符&gt;&gt;，移动多少位表示除以2的几次幂。 具体可以转到博客：按位运算符. 上面是个基础知识的补充。 ###在Unity中是用LayerMask### Layers 官方给出的描述是：Layers are most commonly used by Cameras to render only a part of the scene, and by Lights to illuminate only parts of the scene. But they can also be used by raycasting to selectively ignore colliders or to create collisions。 翻译下就是：Layers通常被摄像机用来渲染部分场景，和灯光照射部分场景使用。但是它们也可以用来做射线检测时忽略一些collder或Collision使用。 如何编辑Layers. 在代码中使用时如何开启某个Layers？ LayerMask mask = 1 &lt;&lt; 你需要开启的Layers层。 LayerMask mask = 0 &lt;&lt; 你需要关闭的Layers层。 举几个个栗子： LayerMask mask = 1 &lt;&lt; 2; 表示开启Layer2。 LayerMask mask = 0 &lt;&lt; 5;表示关闭Layer5。 LayerMask mask = 1&lt;&lt;2|1&lt;&lt;8;表示开启Layer2和Layer8。 LayerMask mask = 0&lt;&lt;3|0&lt;&lt;7;表示关闭Layer3和Layer7。 上面也可以写成： LayerMask mask = ~（1&lt;&lt;3|1&lt;&lt;7）;表示关闭Layer3和Layer7。 LayerMask mask = 1&lt;&lt;2|0&lt;&lt;4;表示开启Layer2并且同时关闭Layer4. 代码： using UnityEngine; using System.Collections; public class example : MonoBehaviour { LayerMask mask = ~（1&lt;&lt;3|1&lt;&lt;7）; void Update() { if (Physics.Raycast(transform.position, transform.forward, 100, mask.value)) Debug.Log(&quot;Hit something&quot;); } }","link":"/2015/05/05/Unity3D/Unity中Layer和LayerMask解析/"},{"title":"梦里江南","text":"淡烟迷津，在这细雨中洒洒落落。 夜色如一袭黑色的轻纱，从这江南柔嫩的肌肤上轻轻滑过。一阵清风拂过我的船舷，撩去我窗棂的旧漆。 她双腿慵懒地交叉，美人侧卧，然后轻轻的合上眼脸，随夜一起进如梦中，偶尔传来几声轻鼾，也如醉人的天籁。 是雾，抑或月影，朦胧中摇曳着几家灯火。 我凝着咫尺的思念，盼在舟中倚窗而望，月光千里，我只取寸许，思念万丈，只能全部给你。 水纹荡漾衣锦鲤以清裳，锦鲤含荷饰缟纱以秀纹。石桥边的几颗弱柳扶风，风再稍微紧些，又似几波涟漪。 初晨，她目光温柔而清新，一阵清风撩过发丝，她慵懒的发出几声轻哼。丹顶体白的仙鹤飘逸在远方的芦苇沼泽中，几苇渔舟荡在幽澄清澈的小河中。绿瓦青房循河参差而立，曲折的弄堂小巷里不时传出吆喝声。 桥前古井，茶社柳下，朴鲜桑木的八仙桌旁，鹤发老叟正在执子深思，一子落毕，老叟望我而来，眼神中无限唏嘘，继而惆怅不语。 花靛衣边的陶瓷杯，一掬刚煮沸的清泉，炽烟袅袅，奔腾而上，如龙盘旋。你用手轻轻的扇了扇，烟雾嬉笑着从你的面庞轻吻而过。 几落茶叶沉沉浮浮，不识红尘，彼此人生，抿一小口，又是几千春梦。我抬头幽幽的望着你的背影。 八角亭下蹙眉静候的芙裙少女，每一次摆弄衣角就多了一份思念，宅门前一生相伴的祥扣铜环，每一次相扣都在重复着彼此的誓言。 石桥上的苔痕湿润了我的双眼，几声鸟鸣将你叫唤到我眼前，轻吸一口微香，再不愿醒来。 夜留踪笔","link":"/2012/02/20/凡尘集/梦里江南/"},{"title":"落叶相随","text":"2012-5-26 晚，知红颜，欲离别，黯然伤神，孤情偶记。 路灯寻找着树叶末梢最后的一点翠，夜色也如你眼眸一般无尽的黑；愁情却似海浪一般的拍打着我的心肺，连呼吸都需要自己找个理由来安慰，该如何面对。 鼻尖微微泛着酸水眼睛里黯然的噙着泪虽有百年相交却最终是各不相随 荷叶微凉莲轻睡花与叶熟悉的如此暧昧奈何雾里看花又是为哪般美 落花随风风自吹究竟以怎样的姿态坠落才算最美红尘里相遇相离又是为了谁 弹指轻挥流年清澈如你你如水从此只能在回忆里自饮自醉醒来后默语伤神暗自后悔 我一直以为人生不过佳人侧卧美酒千杯原来这一切都只是我以为 记忆里的你太美现实却隐藏着太悲不忍思念如月色般破碎遥寄此诗与你相随莫相知 莫相忘 莫相随 时光暗转 柳絮轻飞 如有佳期 江南再会","link":"/2012/05/26/凡尘集/落叶相随/"},{"title":"分离","text":"我们的爱情还是没能经得住岁月的旁敲侧击不知是哪一次别离谁都都没开口说出那句对不起！我已不再爱你因为我们都还珍惜那段暧昧的友谊或许也或许都还心存侥幸期待下一次死心塌地","link":"/2011/09/08/竹叶集/分离/"},{"title":"假借回忆之名","text":"那时候也许我们都已不再年轻我还是爱背着包去旅行喜欢劳累过后的一份安静因为安静有你 有时会害怕去面对自己偶尔被往事提醒也常常被遗憾压抑因为未曾珍惜 可能那时会经过你在的城里可是却找不到理由去看你翻开相机里的那些记忆因为怀念过去 还是会写一些莫名其妙的东西也许是关于爱情也许会读到你的身影别生我的气所有的这些我只能给借口假借回忆之名…… 回到回忆里好提醒我自己现在心里还幽幽的爱着你","link":"/2012/02/05/竹叶集/假借回忆之名/"},{"title":"夏末微凉","text":"这个夏天少了我你有没有难过有没有想过我曾经要拉着你的手 一个人在风景里走想你时就连水也润不了喉风也没有了那般刻意的温柔 走着走着就失去了什么我笑着摇了摇头我们之间就像做朋友只是慢慢的懂了舍不得 想想要挽留不知该怎么说出口踌躇着踌躇着这个夏天就这样走过 期待着却没有发生什么念念不忘中也没留下什么只是多了一些舍得舍不得 2011-8-29 21:02","link":"/2011/08/29/竹叶集/夏末微凉/"},{"title":"安卓开发之基本构件","text":"1、Activity 一个Activity，通常是用户在某一个时刻，在设备上看到的单独的界面。一个应用程序通常含有多个Activity，用户可在期间进行切换。对用户而言，这就是程序的外观部分。 Activity的生命周期：启动一个Activity可能会消耗大量资源。他可能会涉及到新建一个Linux进程、为UI对象申请内存空间、从UML布局填充所有对象，以及创建整个界面。为了避免这种浪费，Android通过ActivityManager来管理活动的生命周期。 ActivityManager负责创建、销毁、管理Activity。 在Android编程与在其他环境中编程有些区别。在Android中你会发现更多的是对应用程序的状态改变做出响应，而很少主动改变它的状态。Android是一个被外部控制和管理起来的环境，与在Javaapplet和servleet中编程有些相似。因此谈及Activity的生命周期我们很少会说他的当前状态，更多的是说状态转换过程。 （1）启动状态：onCreate()、onStart()、onResume() 当一个活动（Activity）还不存在与内存中时，我们称其为启动（Starting）状态。当它启动时，活动会调用一整系列由开发人员有机会指定的回调函数。最后活动（Activity）hi进入运行状态（running）。 注意，从启动状态到运行状态的转换时最耗时的操作之一。耗时就是耗电，对电池的续航能力也有直接的影响。因此不再显示的活动不会被轻易的销毁，而是使它驻留在内存中，这样用户下次访问的时候可以节省资源。 （2）运行状态 处于运行状态的活动，是指当前显示在屏幕上与用户交互的活动。我们也称该活动获得了焦点（in foucs），意味着所有用户交互——例如打字，触摸屏幕，单击按钮——都由这个活动处理。由此可知同一时刻只能有一个活动处于运行状态。 正在运行的活动可以优先获取它所需内存或资源，以便尽量以最快的速度运行。 （3）暂停状态 当活动没有获得焦点（例如没有与用户交互），但仍显示在屏幕上时，它就处于暂停状态（paused）。 活动会在停止前进入暂停状态。暂停状态的活动依然拥有获取内存或者其他资源的优先权。因为他们依然显示在屏幕上，应该尽量避免使用户感到不自然。 （4）停止状态 当一个活动不再显示却依然驻留在内存中的时候，我们称其为停止状态（stopped）。停止状态的活动可以再次显示，成为一个运行状态，也有可能被销毁并从内存中移除。 系统会将处于停滞状态的活动保留一段时间，因为用户很可能稍后希望在返回到这些活动，并且重新启动一个停止的活动远比初始化一个新的活动代价要小。 停止状态的活动可能随时被从内存中移除。 （5）销毁状态 销毁（destroyed）状态不在驻留在内存中。当活动管理器认为不在需要某个活动的时候机会移除它。在活动被销毁之前，他可以做一些特定的操作，比如保存信息。但是Android并不保证你的活动在销毁前会先被停止，暂停的活动也一样可能内销毁。因此，最好在切换回暂停状态时执行重要的工作。 实际上，运行中的状态并不意味着他正在进行频繁的运算，他可能只是在那里等待用户的输入。相似的处于停止状态的活动也不一定什么都不做。状态名称主要是指活动对于用户输入的响应程度，换句话说即一个活动是否课件，获得焦点，或者根本不可见。 2、Intent Intent是指在主要构件之间传递的消息。它能够触发并启动一个消息，告诉一个服务启动还是停止，或者只是简单地广播。Intent是异步的，这意味着发动它们的代码不必等待它们完成并返回。 Intent分为显式的（expicit）和隐式的（implicit）两种。在显式的Intent中，发送者需要明确的指定接收Intent的组件。在隐式的Intent中，发送者只需指定接收者的类型。 3、服务（Service） 服务运行于后台，没有任何用户界面。它们可以喝活动一样执行相同的操作，但是没有任何用户界面。服务用于不管界面上有什么，我们都希望可以执行一段时间的操作。例如：你可能希望在其它应用程序之间切换时，音乐播放器依然可以播放歌曲。 服务的生命周期比活动要简单地多。你可以启动或停止一个服务，同样的服务的生命周期或多或少的由开发人员控制，受系统控制相对较少。 虽然服务运行于后台，但这并不是说它在另一个独立的线程上运行。而如果一个服务正在执行一段耗时的操作，你通常需要将它放在单独的线程上处理，否则将影响你的用户界面的响应速度。简单地说，服务和活动运行在同一个主应用程序线程中，这个线程也被称为UI线程。 注意：不要将Android的服务（这些都是Android英语程序的一部分）和Linux的原生服务、服务器进程或者守护进程相混淆（它们都是操作系统更底层的组件）。 4、内容提供器（ContentProvider） 内容提供器是应用程序之间共享数据的接口。Android默认每个应用程序都运行在自己的沙盒中，这样该应用程序的所有数据与系统中其它程序的数据就完全隔离了。虽然少量的数据可以通过Intent在不同的应用程序之间传递，内容提供器则用于大数据集之间的共享持久数据。为此内容提供器提供了一一套很好的复合DRUD（Creat、Read、Update、Delete）原则。 内容提供器的接口相对比较简单，就是标准的insert()、update()、delete()、qurey()方法。这些方法看上去很像标准的数据库方法，因此为数据库实现一个内容提供器作为代理业相对简单。我们应该尽可能的使用内容提供器而不是自己去实现。 5、广播接收器（BroadcastReceiver） 广播接收器是Android在系统级别对“发布——订阅”机制，或者说观察者模式（Observer）的实现。接收器一般只是等待，直到其订阅的事件发生时，才被激活。 系统自身时时都在进行着广播。例如收到一条短信，接一个电话等的呢。所有这些事件都被广播，而且它们可以出发任意数量的接收器。 可以向应用程序的不同部分发送广播，或者其他完全不同的应用程序发送广播。 广播本身没有任何可视化的展现，也不会在内存中主动进行。但是一旦被触发，它们可能执行某些代码，例如启动一个活动，服务或其他。 6、应用程序上下文（ApplicationContext） 应用程序上下文是应用程序环境及其所有组件运行所在的进程。它允许应用程序在不同的构件中共享数据和资源。 不管应用程序中首先启动的是活动、服务还是其它构件，都会先创建应用陈新股上下文。只要你的应用程序没有消亡，应用程序上下文也会一直存活。正因为如此，应用程序上下文与生命周期无关。你可以通过Context.getApplicationContext()或Activity.GetApplication()来获得对上下文的引用。 注意，Activity和service都是上下文的子类，因此他们也就继承了上下文的所有方法。","link":"/2015/10/31/安卓开发/安卓开发之基本构件/"},{"title":"如是我爱","text":"我若爱，定会深爱抱是你，宠是你不让你受一点委屈哪怕是委屈了我自己 我若爱，定会执爱想是你，念是你梦中偷偷的吻了你哪怕这个梦不会再醒 我若爱，定会挚爱醒是你，梦是你日日在身边守护着你哪怕从此山河永寂 我若不爱，定会放弃来是你，去是你无论是谁转身的一瞬都将是封尘的记忆 我若不爱，定会伏笔悲是你，喜是你无论是有心还是无意永远也擦不掉被写下的痕迹","link":"/2011/04/24/竹叶集/如是我爱/"},{"title":"如果我不再爱你","text":"如果我不再爱你要记得照顾好自己在外零食要少吃衣服要经常洗 如果我不再爱你千万不要哭泣因为你的泪滴还流在我的心里 如果我不再爱你对于怎样的我一定不要向他提起爱会让人心生妒忌 如果我不再爱你我会好好珍惜曾经我们在一起一张张美好的回忆 如果我不再爱你别说要让彼此忘记因为我只是说只是说如果而已","link":"/2011/04/10/竹叶集/如果我不再爱你/"},{"title":"当你我老去","text":"When You are Old ——by William Butler Yeats When you are old and gray and full of sleep, And nodding by the fire, take down this book, And slowly read, and dream of the soft look, Your eyes had once, and of their shadows deep. How many loved your moments of glad grace, and loved your beauty with love false or true, But one man loved the pilgrim soul in you, and loved the sorrows of your changing face. And bending down beside the glowing bars, Murmur, a little sadly, how love fled, And paced upon the mountains overhead, And hid his face amid a crowd of stars. 时光无情，当你我老去，头发花白，闲倚炉边。 睡意来袭之时，如若念起往昔，记得取此诗篇，缓缓轻吟。 梦回如今，你的眼中还留有那般醉人的柔情， 还是会在睫毛间投下的深深的忧郁的阴影。 想起那时年少，有多少人爱慕你那美丽的容颜， 虚情假意，如何繁华也难以抵挡时间的轻轻清清洗。 追忆往事，终有一个男子， 如虔诚者般深深的爱慕着你的心灵， 守护着那些时光在你脸上留下的伤心。 当你在窗边佝偻着身躯抬起容颜， 苦涩地念起爱是如何远去。 爱就是你曾经抬头即可望见的风景， 却隐藏在你孤独难眠的深深深夜里。","link":"/2014/11/17/竹叶集/当你我老去/"},{"title":"念","text":"执思念轻轻散开你身上如风 想心情静搁一方你怀里如水 爱彼此花开不落你心里如梦","link":"/2012/02/05/竹叶集/念/"},{"title":"我试着想起你当初的模样","text":"生活就这样无聊的过着，重复着一天又一天，无意中扒出的日记本，随便翻开一页便是很多年。 你总是认真听讲，你总是按时完成作业，你总是不让我安心睡觉，你总是劝我不要跟人打架免受牵连。 我说你怎么跟我妈一样，我妈也没你管的那么严，然后你给我一个大白眼，告诉我书该翻到多少页。。 你是否还在追逐你当初的梦想，是否还是想当年一样，扎着俏皮的马尾辫，用手遮着眯起的眼睛看明天。 后来我不在你身边，你是否改变了模样，是否不会再烦心，作业本不见，是否已经忘记，那个不爱学习的少年。 时隔多年以后，再试图拾起昨天，试图想起你那时的模样，想起我们当初在一起的青涩流年。 那时的我从不会去想明天，从来不会想学习会对我有什么改变，只是知道就这样，这样可以有理由抄你的作业。 尽管有些死皮赖脸！ 现在我，早已经不是当初的那个少年，只是想起你的时候，已经记不清你的模样。","link":"/2013/09/05/竹叶集/早恋/"},{"title":"暗语","text":"关于你的许多我都不知道该怎么说脑袋里想的都是一些看不清的执着 有时候喜欢一个人不需要知道对与错就是恪守一份淡淡的快乐即使是一个眼神的划过 有时候喜欢一个人不需要知道是否有结果也许是结果太过做作所以我们喜欢回忆在一起的经过 有时候喜欢的一个人不需要要求她能够懂得无意中做过的许多就已经在解释了许多 如果再喜欢一个人我想还是不要告诉她好了为什么谁又会知道为什么","link":"/2012/02/20/竹叶集/暗语/"},{"title":"渴望","text":"我渴望你那母性的呵护我渴望你那温柔的呼吸我渴望拥抱你那淡淡的体香我渴望你一个安抚的眼神","link":"/2012/09/06/竹叶集/渴望/"},{"title":"远方的姑娘","text":"夜色揪扯着爱人的思念 爱人是远方那美丽的姑娘 她有着漆黑明亮的双眼 她以前待我和别人一样 如今却再也不看我一眼 姑娘是否已经喜欢上了别的人 请别告诉我 请别告诉我 让我再自作多情一会也好 让我再安静的思念一会也好 让我随时光一起变老","link":"/2014/12/04/竹叶集/远方的姑娘/"},{"title":"雨中漫步","text":"漫步在雨中幻想幻想着有你的同行你挽着我的胳膊我望着你的眼睛相视一笑彼此心有灵犀","link":"/2011/05/27/竹叶集/雨中漫步/"},{"title":"风铃","text":"我想要个风铃这样在我寂寞的时候想起你就可以听听风的声音","link":"/2011/05/03/竹叶集/风铃/"},{"title":"风光","text":"风光下 过路的情人一再把我误伤 心痛后 便去山中顿悟 衣衫不整 鸟语花香纷纷绕开 唯有静默的莲花开合有度 我用一叶知秋 为知心削发 爱过的女子纷纷向我老去 写过的诗篇还在迷惑人心 我一一恩准","link":"/2015/02/11/竹叶集/风光/"},{"title":"自卑的孩子","text":"我赤着脚在沙滩上奔跑我不敢回头因为我怕但我不知道我在怕什么","link":"/2012/09/02/飞思集/自卑的孩子/"},{"title":"飞思","text":"漆黑的夜晚安静的像一片树叶随白天最后一缕光芒悄悄的落在这片土地上 我踩着心跳声从喧扰的宿舍里逃出来走进默默的灯光中走入一条偏僻的小径里 如此静谧如此祥和的夜能陪伴我的只有那一排微弱的路灯 我向他们遥遥望去他们向我温柔的看来我们之间就像相爱许久的恋人没有言语 却心有灵犀 甚至有那么一瞬间我忽然有一种错觉前面那一盏盏的路灯就是我将要的归宿 我走在灯光下我行至柳树旁我坐在水岸边我抬头向天空凝望 月亮正打着灯笼在云朵里寻找她的光芒这一刻 陪伴我的只有宁静 没有孤单","link":"/2012/09/04/飞思集/飞思/"},{"title":"简单的一遍编译器","text":"###1、概述### 程序设计语言可以通过以下两个方面来定义：第一方面是程序模式，即语言的语法；第二方面是程序含义，即语言的语义。 为了说明语言的语法，我们介绍一种广为使用的表示法：上下文无关文法或者BNF（Backus-Naur范式）。使用现有的表示语法描述语言的语义要比描述语言的语法难得多。因此，在定义语言的语义时，我们将使用非形式化方法和启发性实例。 上下文无关文法除了可以用于定义语言的语法之外，还可用于指导源程序的翻译，面向语法的编译技术，如语法制导翻译技术，对于组织编译器的前端十分有用。 在我们的编译器中，词法分析器首先把输入字符流转换成记号流。然后记号流作为下一个阶段的输入，产生源程序的中间表示。 ###2、语法定义###语句具有如下形式： if(表达式) 语句 else 语句 如果用expr来标识表达式，使用stmt来标识一条语句，则if-else语句的构造规则可以表达为 stmt -&gt; if(expr) stmt else stmt 箭头可以读作“可以具有形式”。这样的规则称为“产生式（Production）”。在一个产生式中，，像关键字if和括号这样的词法元素称为记号（token），像stmt和expr这样的变量标一个记号序列，并称之为非终结符（nonterminal）。 上下文无关文法包含如下四个部分： 1、一个记号集合。 2、一个非终结符集合 3、一个产生式集合。每个产生式都具有一个左部和一个右部，左部和右部由箭头连接，左部是一个非终结符。。右部是记号和非终结符序列。 4、一个开始符号。开始符号是一个指定的非终结符。 如果一个非终结符出现在一个产生式的左部，该产生式称为该非终结符的产生式。记号串是零个或者多个记号序列。一个包含零个记号的记号串称为空串，记为ε。 从开始符号出发，反复替代产生式中的非终结符（用该非终结符的产生式的右部），一个文法可以产生一个串。由一个文法的开始符号产生的记号串形成了该文法定义的语言。 ####分析树#### 分析树描绘了如何从文法的开始符号开始推导它的语言中的一个语句。 如果非终结符具有一个产生式A-&gt;XYZ，则A的一棵分析树如右图所示，内节点标记为A，A的三个子节点从左到右分别标记为X、Y和Z。 形式地说，给定一个上下文无关法，分析树是具有如下特性的树： 1、树根标记为开始符号。 2、每个叶节点由记号或空标记。 3、每个内节点由一个非终结符标记。 4、如果A是某个内节点的非终结符标记，X、Y、Z是该节点从左到右排列的子节点标记，则A-&gt;XYZ是一个产生式。这里的X、Y、Z是一个终结符或非终结符。对于A-&gt;空，分析树中标记A的节点只有一个标记为空的子节点。 一棵分析树从左到右地叶节点是这个分析树生成的结果。分析树生成的结果是由根节点的非终结符生成或导出的串。 使用分析树的概念，我们可以定义：一个文法生成的语言是它的某个分析树生成的串的集合。为给定的记号串找到一个分析树的过程称为这个串的语法分析（parsing）。 ####二义性####","link":"/2015/04/28/编译原理/简单的一遍编译器/"},{"title":"飞思二","text":"未来将如何谁有想过是不是我们有所学便有所得对于未来你的世界里还会不会有我我们谁都不敢去说但是我们都希望是有的因为人都是害怕失去的即便我们曾经拥有过即便我们曾经是彼此拥有 对于朋友突然地关心感觉很错愕还以为他已经不记得我了然后就寒暄着说我还好过的很快乐你呢其实自己都不知道现在的日子叫什么也许就像人们常说的都是自找的 也不知道自己是怎么了何时学会这一套虚伪的附和即便是心有愧意也是面无改色曾经那颗不可一世的心到底是碰上了什么成为这一世不可 前面的路还有多少坎坷以后得生活还有多少波折我还有什么我该怎么做到底是为了什么如果只是为了快乐那现在我该拿什么去堕落又是否值得","link":"/2012/02/28/飞思集/飞思二/"},{"title":"编译简介","text":"编译由两部分组成：分析与综合。 分析部分将源程序切分成一些基本块并形成源程序的中间表示，综合部分把源程序的中间表示转换为所需的目标程序。 在分析期间，源程序所蕴含的操作将被确定下来并被表示成为一个称为语法树的分层结构。语法树的每个节点表示一个操作，该节点的子节点表示这个操作的参数。 ###编译器的前驱与后继### 预处理器：源程序可能被分成模块存储在不同的文件中。把存储在不同文件中的程序模块集成为一个完整的源程序这个任务一般由预处理器的程序去完成。预处理器也能够把源程序中称为宏的缩写语句展开为原始语句加入到源程序中。 ###源程序分析### 在编译中，源程序的分析由如下三个阶段组成： 1、线性分析（词法分析）。在线性分析中，从左到右地读构成源程序的字符流，而且把字符流分组为多个记号（token），而记号是具有整体含义的字符序列。 2、层次分析（语法分析）。在层次分析中，字符串或记号在层次上划分具有一定层次的多个嵌套组，每个嵌套组具有整体的含义。 3、语义分析。在语义分析中要进行某些检查，以确保程序各个组成部分确实是有意义地组合在一起的。 ###编译的各个阶段### 编译器的一个基本功能室记录源程序中使用的标识符并收集每个标识符的各种属性信息。标识符的属性信息表明了该标识符的存储位置、类型、作用域（在哪段程序中有效）等信息。当一个标识符是过程名时，它的属性信息还包括诸如参数的个数与类型、每个参数的传递方法（如传递地址方式）以及返回值的类型等信息。 1、符号表管理：符号表是一个数据结构。每个标识符在符号表中都有一条记录，记录每个域对应于该标识符的一个属性。这种数据结构允许我们快速地找到每个标识符的记录，并在该记录中快速的存储和检索信息。 2、错误检测与报告：语法分析和语义分析阶段通常能够处理编译器所能检测到的大部分错误。 词法分析阶段能够检测出输入中不能形成源语言任何记号的错误字符串。语法分析阶段可以确定记号流中违反源语言结构（语法）规则的错误。语义分析阶段试图检测出具有正确的语法结构但对操作无意义的部分。 3、各分析阶段。 4、中间代码生成。 某些编译器在完成语法分析和语义分析以后，产生源程序的一个显式中间表示。我们可以将这种中间表示看成是某种抽象机的程序。源程序的中间表示应该具有两个重要性质。一是易于产生，二是易于翻译成目标源程序。 5、代码优化。 6、代码生成。 ###编译器的伙伴### 1、预处理器。预处理器产生编译器的输入，一般具有以下功能： （1）、宏处理。预处理器允许用户在源程序中定义宏。宏是被经常使用的较长结构的缩写。 （2）、文件包含。预编译器可以把头文件包含到程序正文中。 （3）、“理性”预处理器。这些处理器能把现代控制流和数据结构化机制添加到比较老式的语言中。例如：如果一种语言没有while语句和if语句这样的控制结构，理性预处理器可以用内部宏定义向用户提供这样的控制结构。 （4）、语言扩充。这类处理器通过大量的内部宏定义来增强语言的能力。 宏处理器处理两种类型的语句：宏定义和宏引用。 宏定义由具有惟一性的字符或者关键字来标识，如define或macro。宏定义包含被定义的宏的名字或构成其定义的体。通常，宏处理器允许宏定义中包含形式参数。宏的引用只需要提供宏名和实际参数。 2、汇编器 某些编译器产生汇编代码。汇编代码需要交给汇编器做进一步处理，有些编译器能够完成汇编器的工作，产生可重定位的机器代码，交给装配器（Loader）或链接编辑器（Link-editor）。 3、两遍汇编 最简单的汇编器对输入汇编源程序文件进行两遍扫描，每遍读输入文件一次。在第一遍扫描中，表示存储单元的所有标识符都被识别出来并出入符号表（汇编器的符号表和编译器的符号表是分开的）。一个标识符的存储单元式在它在第一次被遇到时分配的。 在第二遍扫描中，汇编器再一次从头扫描输入文件。这一次它将每个操作符翻译成机器语言中代表相应操作的二进制位序列，将代表存储单元的每个标识符 翻译成符号表中该标识符的地址。 第二遍扫描的输出时刻重定位的机器代码。可重定位指的是装入的起始地址可以使任意的内存单元L。也就是说，如果将L加到代码的所有地址上，整个程序对所有存储地址的引用都是正确的。为此，汇编器的输出必须说明哪些指令中引用了可重定位地址。 4、装配器和连接编辑器 通常，装配器完成程序的装入和连接编辑两项功能。装入过程包括读入可重定位机器代码，修改可重地位地址，并将修改后的指令和数据放到内存中适当的位置。 连接编辑器允许我们将多个可重定位机器代码的文件组装成一个程序。这些可重定位机器代码的文件可以使多次编译的结果，其中一个或多个可能是库程序文件。库程序文件时由系统提供的，可以被任何程序使用。 ###编译器各个阶段分组### 1、前端与后端 编译器可以分为前端和后端两个大的阶段。前端依赖于源语言并在很大程度上独立于目标机器的某些阶段或者某些阶段的某些部分。前端一般包括词法分析、语法分析、符号表建立、语义分析、中间代码生成以及相关的错误处理。相当一部分的代码优化工作也在前端完成。 后端包括编译器中以来目标机器的阶段或某些阶段的某些部分。一般来说，后端完成的任务不依赖于源语言而只依赖于中间语言。后端主要包括代码优化、代码生成以及相关的错误处理和符号表操作。 2、编译器的遍 3、减少编译的遍数 ###编译器的构造工具### 1、分析生成器。 2、扫描生成器。 3、语法制导翻译引擎。 4、自动代码生成器。 5、数据流引擎。","link":"/2015/04/22/编译原理/编译简介/"},{"title":"飞鸟","text":"当飞鸟翱翔于天空便认为自己自由了却不知它仍属于天空","link":"/2011/02/27/飞思集/飞鸟/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","link":"/tags/读书笔记/"},{"name":"读书","slug":"读书","link":"/tags/读书/"},{"name":"Unity3D","slug":"Unity3D","link":"/tags/Unity3D/"},{"name":"散文","slug":"散文","link":"/tags/散文/"},{"name":"回忆","slug":"回忆","link":"/tags/回忆/"},{"name":"爱情","slug":"爱情","link":"/tags/爱情/"},{"name":"凡尘集","slug":"凡尘集","link":"/tags/凡尘集/"},{"name":"古典","slug":"古典","link":"/tags/古典/"},{"name":"江南","slug":"江南","link":"/tags/江南/"},{"name":"竹叶集","slug":"竹叶集","link":"/tags/竹叶集/"},{"name":"大学随想录","slug":"大学随想录","link":"/tags/大学随想录/"},{"name":"往事","slug":"往事","link":"/tags/往事/"},{"name":"Android","slug":"Android","link":"/tags/Android/"},{"name":"诗歌","slug":"诗歌","link":"/tags/诗歌/"},{"name":"翻译","slug":"翻译","link":"/tags/翻译/"},{"name":"早恋","slug":"早恋","link":"/tags/早恋/"},{"name":"情诗","slug":"情诗","link":"/tags/情诗/"},{"name":"思念","slug":"思念","link":"/tags/思念/"},{"name":"飞思集","slug":"飞思集","link":"/tags/飞思集/"},{"name":"心理学","slug":"心理学","link":"/tags/心理学/"},{"name":"编译原理","slug":"编译原理","link":"/tags/编译原理/"},{"name":"学习笔记","slug":"学习笔记","link":"/tags/学习笔记/"}],"categories":[{"name":"Reading","slug":"Reading","link":"/categories/Reading/"},{"name":"Unity3D","slug":"Unity3D","link":"/categories/Unity3D/"},{"name":"凡尘集","slug":"凡尘集","link":"/categories/凡尘集/"},{"name":"竹叶集","slug":"竹叶集","link":"/categories/竹叶集/"},{"name":"飞思集","slug":"飞思集","link":"/categories/飞思集/"},{"name":"编译原理","slug":"编译原理","link":"/categories/编译原理/"}]}